{"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"1992-02-23","genres":[{"id":35,"name":"Comedy"}],"homepage":"","id":377,"in_production":true,"languages":["en"],"last_air_date":"1994-02-06","last_episode_to_air":{"air_date":"1994-02-06","episode_number":6,"id":19358,"name":"Series 3 Episode 6","overview":"Mr Bloom and Dolly Finkel are getting married and Yetta isn't invited, so she pulls out the stops to make herself 'real' for the day promising to behave herself... people can be so gullable.\n\nWhile trying to work up the courage to ask for a pay rise at work, Pete ends up being pressured to uproot himself and his family to take up a job in Russia.\n\nTammy's in an emotional state when her family don't take suggestions she might want to marry Lawrence seriously. Things are made worse when she overhears Dolly saying that Tammy would be an unsuitable life partner for Lawrence as she isn't Jewish.","production_code":"","season_number":3,"show_id":377,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"So Haunt Me","next_episode_to_air":null,"networks":[{"name":"BBC One","id":4,"logo_path":"/mVn7xESaTNmjBUyUtGNvDQd3CT1.png","origin_country":"GB"}],"number_of_episodes":19,"number_of_seasons":3,"origin_country":["GB"],"original_language":"en","original_name":"So Haunt Me","overview":"So Haunt Me is a British television sitcom about a family that moves into a home occupied by the ghost of its previous resident, a middle-aged Jewish mother. The show was produced by Cinema Verity for the BBC and originally aired from 1992 to 1994.\n\nPeter Rokeby loses his job as advertising copywriter, and resolves to become a freelance writer. Owing to this change in circumstances, he and his wife Sally move with their children into a more modest home in Meadow Road, Willesden. The family soon finds that the ghost of a previous owner, Yetta Feldman, still occupies the residence, and has been scaring occupants away for years. Yetta is a stereotypical interfering, middle-aged Jewish mother who died suddenly after choking on a chicken bone. While Sally can both see and speak to their ghost, Peter — much to his frustration — initially cannot. The family agrees to help Yetta find her grown-up daughter Carole.\n\nSo Haunt Me aired on BBC1 as 18 half-hour episodes in three series and one special from 1992 to 1994. The show was created by Paul Mendelson. The Rokeby children David and Tammy were played by Jeremy Green and Laura Howard respectively. Neighbour Mr Bloom was played by David Graham.","popularity":2.381,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"1992-12-20","episode_count":1,"id":1110,"name":"Specials","overview":"","poster_path":null,"season_number":0},{"air_date":"1992-02-23","episode_count":6,"id":1108,"name":"Season 1","overview":"","poster_path":"/mdsNgTBeJlKqkfmBHNE5FC6JFmw.jpg","season_number":1},{"air_date":"1992-12-20","episode_count":7,"id":1107,"name":"Season 2","overview":"","poster_path":null,"season_number":2},{"air_date":"1994-01-02","episode_count":6,"id":1109,"name":"Season 3","overview":"","poster_path":null,"season_number":3}],"status":"Ended","type":"Scripted","vote_average":7.3,"vote_count":3}