{"backdrop_path":null,"created_by":[{"id":137380,"credit_id":"52537a7119c2957940183d4f","name":"Sylvia Anderson","gender":0,"profile_path":"/4bIiXMlHLxJc0NGYHAOhEeiyP7U.jpg"},{"id":1213685,"credit_id":"52537a7119c2957940183d49","name":"Gerry Anderson","gender":2,"profile_path":"/yw12JLxblMxnYCNH1u3KiABBn2X.jpg"}],"episode_run_time":[30,25],"first_air_date":"1967-09-29","genres":[{"id":10759,"name":"Action & Adventure"},{"id":16,"name":"Animation"}],"homepage":"","id":486,"in_production":false,"languages":["en"],"last_air_date":"1968-05-14","last_episode_to_air":{"air_date":"1968-05-14","episode_number":32,"id":24153,"name":"The Inquisition","overview":"While relaxing at a smart countryside restaurant during a late evening, Captain Blue, accompanied by Captain Scarlet, starts to feel strange after drinking a cup of black coffee.\n\nWhen Scarlet goes to fetch their coats, Blue instantaneously disappears, and when awakening, finds himself sitting in Lieutenant Green's chair back on Cloudbase, with a Spectrum Intelligence agent, who calls himself Colgan, sitting in Colonel White's chair.\n\nHe explains that Blue has been absent without leave for three months, and must prove his identity by disclosing top-security information; the Spectrum cipher codes, before he can return to active duty.\n\nWithout having to do this, Captain Blue instead story-tells three Spectrum assignments involving the Mysterons: the nuclear attack on London, the mission of destroying the Mysteron complex in Crater 101, and the prevention of a Mysteronised Commodore and his aid from slaughtering the Supreme Command of the World Air Force at the Scottish Glen Garry","production_code":"","season_number":1,"show_id":486,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Captain Scarlet and the Mysterons","next_episode_to_air":null,"networks":[{"name":"Associated Television","id":117,"logo_path":"/hEdI56n4EHSP6kto7BUPEOb6bqo.png","origin_country":"GB"}],"number_of_episodes":32,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Captain Scarlet and the Mysterons","overview":"Captain Scarlet and the Mysterons, often referred to as Captain Scarlet, is a 1960s British science-fiction television series produced by the Century 21 Productions company of Gerry and Sylvia Anderson, John Read and Reg Hill. First broadcast on ATV Midlands from September 1967 to May 1968, it has since been transmitted in more than 40 other countries, including the United States, Australia, New Zealand and Japan. Characters are presented as marionette puppets alongside scale model sets and special effects in a filming technique that the Andersons termed \"Supermarionation\". This technology incorporated solenoid motors as a means of synchronising the puppet's lip movements with pre-recorded dialogue.\n\nSet in 2068, Captain Scarlet presents the hostilities between Earth and a race of Martians known as the Mysterons. After human astronauts attack their city on Mars, the vengeful Mysterons declare war on Earth, initiating a series of reprisals that are countered by Spectrum, a worldwide security organisation. Spectrum boasts the extraordinary abilities of its primary agent, Captain Scarlet. During the events of the pilot episode, Scarlet acquires the Mysteron healing power of \"retro-metabolism\" and is thereafter considered to be virtually \"indestructible\", being able to recover fully from injuries that would normally be fatal.","popularity":4.875,"poster_path":"/83Q8UHBJYLQx4bbCDYvt3TxODd1.jpg","production_companies":[{"id":15980,"logo_path":null,"name":"Incorporated Television Company (ITC)","origin_country":"GB"},{"id":6141,"logo_path":null,"name":"Century 21 Television","origin_country":""}],"seasons":[{"air_date":"2001-01-01","episode_count":1,"id":1390,"name":"Specials","overview":"","poster_path":null,"season_number":0},{"air_date":"1967-09-29","episode_count":32,"id":1389,"name":"Season 1","overview":"2068: Earth is at war with a bizarre Martian enemy - the Mysterons. Only Spectrum the world security organisation, and its number one agent, Captain Scarlet, can hope to defend the planet against the invading aliens and stop the interglactic war of nerves before Earth is destroyed!","poster_path":"/8vNCVvoraKNr1xxpuecH2mK4O59.jpg","season_number":1}],"status":"Ended","type":"Scripted","vote_average":8.3,"vote_count":11}