{"backdrop_path":"/ldPxmHRRcFCCRhT9vXRo33RWwik.jpg","created_by":[],"episode_run_time":[60,90],"first_air_date":null,"genres":[{"id":10763,"name":"News"}],"homepage":"","id":329,"in_production":true,"languages":["en"],"last_air_date":null,"last_episode_to_air":null,"name":"CBC News: Compass","next_episode_to_air":null,"networks":[{"name":"CBC Television","id":23,"logo_path":"/cw5WW6cc9UANam4A6o1BDua9njN.png","origin_country":"CA"}],"number_of_episodes":0,"number_of_seasons":0,"origin_country":["CA"],"original_language":"en","original_name":"CBC News: Compass","overview":"CBC News: Compass is a 90-minute local television news program based in Charlottetown, Prince Edward Island, Canada broadcast from 5:00 PM to 6:30 PM each weeknight AT on CBCT-DT, the CBC owned and operated television station on PEI. It is the only PEI-specific newscast in the province, and has long been well ahead of CTV Atlantic's newscasts in the ratings.\n\nThe newscast launched as a single 60-minute newscast, Compass, in 1986, with Roger Younker as its anchor from its inception until 2002. Younker became well-known and trusted within Prince Edward Island. The humorous and popular weatherman, Kevin \"Boomer\" Gallant, has also been with the program since 1986, and still remains.\n\nIn about 1995, reporter Sara Fraser was brought on as co-anchor with Younker. But in 2000, as a result of budget-cuts, all local supper-hour CBC newscasts were replaced with CBC News: Canada Now, a hybrid national and local newscasts. Younker continued as sole anchor of the PEI-specific half from Charlottetown, with a national program following at 6:30PM local time, presented by Ian Hanomansing from the network's Vancouver studios. In 2002, with Younker's departure, former co-host and long-time correspondent Sara Fraser temporarily succeeded him for one year. In 2003, newcomer Bruce Rainnie was brought in as a permanent replacement for Younker/Fraser as the anchor, and brought his own unique style to the program. Sara Fraser continues as a frequent substitute anchor and correspondent. In May 2006, the local half of the newscast was renamed CBC News at Six: Prince Edward Island.","popularity":0.84,"poster_path":"/bjHTB1FD8Qu7hwDsjjttQA1LalW.jpg","production_companies":[],"seasons":[],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}