{"backdrop_path":null,"created_by":[{"id":1211936,"credit_id":"52532f8a19c2957940006873","name":"Robert D. Cardona","profile_path":null},{"id":1211937,"credit_id":"52532f8c19c295794000687b","name":"David Mitton","profile_path":null}],"episode_run_time":[15],"first_air_date":"1988-11-26","genres":[],"homepage":"","id":23,"in_production":false,"languages":["en"],"last_air_date":"1988-03-22","last_episode_to_air":{"air_date":"1988-03-22","episode_number":13,"id":42,"name":"4th of July","overview":"An Ocean liner called Vienna is to come into Bigg City Port but Lillie Lightships needs to refuel, if there isn't a light Vienna can't come. Supplies are low, Ten Cents and Sunshine try to find oil for Lillie but they only find one which Zorran has and he won't give it to them, He says it's for Vienna. Sunshine knows where to find a light barge. Zip and Zug get the wrong end of the stick and trap Ten Cents and Sunshine by using a fire barge.\n\nBoth fleets are waiting anxiously for Vienna but there is no light. Luckily Warrior saves the day by setting his garbage barge alight for a light for Vienna. Ten Cents and Sunshine wait for the tide to set them free. Vienna comes to Bigg City, the tugs do their job and she goes on her way.","production_code":"","season_number":1,"show_id":23,"still_path":"/maLTEyq2su2IHv1pZ90PDcYH6Ou.jpg","vote_average":0.0,"vote_count":0},"name":"Tugs","next_episode_to_air":null,"networks":[{"name":"ABC","id":18,"logo_path":"/kMvN5R8g6L0SY5r9YZw9foYGQr0.png","origin_country":"AU"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Tugs","overview":"Tugs is a British children's television series first broadcast in 1988. It was created by the producers of Thomas the Tank Engine & Friends, Robert D. Cardona and David Mitton. The series dealt with the adventures of two anthropomorphized tugboat fleets, the Star Fleet and the Z-Stacks, who compete against each other in the fictional Bigg City Port. The series was set in the Roaring Twenties, and was produced by Tugs Ltd., for TVS and Clearwater Features Ltd. Music was composed by Junior Campbell and Mike O'Donnell, who also wrote the music for Thomas the Tank Engine and Friends.\n\nDue to the bankruptcy of production company TVS, the series did not continue production past 13 episodes. Following the initial airing of the series throughout 1988, television rights were sold to an unknown party, while all models and sets from the series sold to Britt Allcroft. Modified set props and tugboat models were used in Thomas the Tank Engine and Friends from 1991 onwards, with footage from the original program being heavily dubbed and edited for use in American children's series Salty's Lighthouse. Mitton returned to working with Thomas & Friends in 1991, while Cardona would go on to direct Theodore Tugboat, a similarly natured animated series set in Canada. All thirteen episodes of the show were released on VHS between 1988 and 1993.","popularity":3.454,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"1989-04-04","episode_count":13,"id":1,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":10.0,"vote_count":1}