{"backdrop_path":"/ee9gve2gj9wV9OEw7ycWj05v5aD.jpg","created_by":[{"id":1039314,"credit_id":"525343f619c29579400b409a","name":"Anthony Zuiker","gender":2,"profile_path":null}],"episode_run_time":[60,30,22],"first_air_date":"2005-05-17","genres":[],"homepage":"","id":183,"in_production":true,"languages":["en"],"last_air_date":"2005-06-14","last_episode_to_air":{"air_date":"2005-06-14","episode_number":5,"id":11418,"name":"Veil of Secrecy","overview":"Britney and Kevin reveal how they kept their wedding day plans a secret, not only surprising fans, but even their family members and closest friends with the private ceremony they held in Studio City, California, last November. Meanwhile, Britney and Kevin's family and friends, including members of the wedding party, discuss how they arrived for a get-together and discovered the couple's true plans for the evening.","production_code":"","season_number":1,"show_id":183,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Britney and Kevin: Chaotic","next_episode_to_air":null,"networks":[{"name":"UPN","id":40,"logo_path":"/333LtWX9Z7H9uRrNcCl1JcTvdpR.png","origin_country":"US"}],"number_of_episodes":5,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Britney and Kevin: Chaotic","overview":"Britney and Kevin: Chaotic is an American reality television series created by Anthony E. Zuiker. Starring American recording artist Britney Spears and her then-husband Kevin Federline, the five-episode series aired on UPN from May 17 to June 14, 2005. The series chronicles the couple's relationship from their courtship, engagement and wedding.\n\nA majority of the footage was originally shot for Spears' own reality series to document the European leg of The Onyx Hotel Tour in the spring of 2004. Spears fell and injured her left knee during the shooting of the music video for \"Outrageous\", causing the remainder of the tour and the series to be cancelled.\n\nBritney and Kevin: Chaotic was heavily criticized by critics, who deemed the series to be career suicide for Spears. Critics noted Spears' excessive narcissism and criticized the themes of the series as being too explicit. The DVD release of Britney and Kevin: Chaotic included Spears' first extended play of the same name.","popularity":1.212,"poster_path":"/pTM1FRiB5yNvTKQC2ZXfLOoG4a8.jpg","production_companies":[],"seasons":[{"air_date":"2005-05-17","episode_count":5,"id":596,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}