{"backdrop_path":"/jem91iwbP4S3mvxaqSfA3VMgLse.jpg","created_by":[{"id":13596,"credit_id":"525335d519c295794003ab5d","name":"David Kirschner","profile_path":null}],"episode_run_time":[30],"first_air_date":"1993-09-11","genres":[{"id":37,"name":"Western"},{"id":16,"name":"Animation"},{"id":10751,"name":"Family"}],"homepage":"","id":74,"in_production":false,"languages":["en"],"last_air_date":"1991-09-07","last_episode_to_air":{"air_date":"1991-09-07","episode_number":1,"id":2726,"name":"Fievel, The Lonesome Ranger","overview":"All mouses of the village are going to The Cheese Festival but Fievel misses the trip.  Cats come to town are searching mouses but they capture Tiger.  Fievel starts to think like The Lonesome Ranger and cats will be in trouble...","production_code":"","season_number":1,"show_id":74,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Fievel's American Tails","next_episode_to_air":null,"networks":[{"name":"CBS","id":16,"logo_path":"/nm8d7P7MJNiBLdgIzUK0gkuEA4r.png","origin_country":"US"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["US","CA"],"original_language":"en","original_name":"Fievel's American Tails","overview":"Fievel's American Tails is an American/Canadian animated television series, produced by Steven Spielberg's Amblimation animation studio, Nelvana, and Universal Cartoon Studios. It aired for one season in 1992, and continued Fievel's adventures from the film An American Tail: Fievel Goes West.\n\nIn 1993 and 1994, MCA/Universal Home Video released twelve episodes on six VHS video-cassettes, two Laserdisc volumes. These have been the only home video releases of the cartoon, at least in the United States. In the United Kingdom, 12 episodes were released on six video-cassettes in 1995, but were in a different episode order to the United States and Vol.4 features the only episode that hasn't been released in the United States. Episodes have been released on DVD in France, Germany, and Italy. Universal currently has no plans to release the show on DVD in the United States, as of November 19, 2009.\n\nIn Russia, the cartoon, dubbed in Russian but retaining the original English titles and names, was broadcast on First Channel Russian Television in summer 1996 with Woody Woodpecker. Repeat airings were broadcast in Spring 2002 and Winter 2005. In Japan, the cartoon was dubbed into Japanese and aired on TBS from January 7, 1995 until March 25 of the same year, showing all the episodes weekly.","popularity":2.37,"poster_path":"/msWEkhcsqi0gfrIIpOonKumOkkT.jpg","production_companies":[],"seasons":[{"air_date":"1991-09-07","episode_count":13,"id":194,"name":"season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":7.0,"vote_count":5}