{"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2006-07-16","genres":[{"id":18,"name":"Drama"}],"homepage":"","id":260,"in_production":true,"languages":["en"],"last_air_date":"2006-08-20","last_episode_to_air":{"air_date":"2006-08-20","episode_number":6,"id":14217,"name":"Episode 6","overview":"As Nathan rushes to tell Fi the truth about Jase's sexuality, there's two versions of events. \n\nThere's the one where he tells her. And the whole sado-masochistic love triangle with four people in it comes crashing down in several completely unexpected and disastrous ways. \n\nThen there's the other version, where he doesn't make the bus, but instead gets in a fight with Derek the anal retentive drug dealer and ends up covered in paint. In this version, instead of telling Fi he loves her, he ends up owning a cancerous rabbit called Mrs Snuggles - but does he get the girl? \n\nWhich one happened? You'll have to wait to find out...","production_code":"","season_number":1,"show_id":260,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Sinchronicity","next_episode_to_air":null,"networks":[{"name":"BBC Three","id":3,"logo_path":"/ex369Frq6w0PaQsVofp21C6tbuC.png","origin_country":"GB"}],"number_of_episodes":6,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Sinchronicity","overview":"Sinchronicity is a six-part drama series broadcast on BBC Three in the United Kingdom. Set in Manchester, the programme is narrated by Nathan and focuses on the love triangle of him, Fi, and Jase. The programme is executive produced by Julian Murphy, who was an executive producer on Channel 4's As If and Sugar Rush and Sky One's Hex. Stylistically similar to As If, following a non-linear narrative, it also features ex-cast members Paul Chequer, Jemima Rooper and Mark Smith and, as such, can be seen as its spiritual successor. The theme tune is \"Boys Will Be Boys\" by the Ordinary Boys. The show was filmed in high definition and was re-run on BBC HD in mid-October 2006.","popularity":1.684,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2006-07-16","episode_count":6,"id":833,"name":"Season 1","overview":"","poster_path":"/3w1c5HWKHgksSfEfFaQEvJ7WAHh.jpg","season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}