{"backdrop_path":null,"created_by":[],"episode_run_time":[5],"first_air_date":"1986-01-06","genres":[{"id":16,"name":"Animation"}],"homepage":"","id":273,"in_production":false,"languages":["en"],"last_air_date":"1987-02-06","last_episode_to_air":{"air_date":"1987-02-06","episode_number":25,"id":14715,"name":"The Computer Clanger","overview":"The Airfield Administration decide to build another \"Jimbo\" for their fleet. To avert another mishap, the Aircraft Factory decide to build the new plane using computers - only this time, they mistake centimetres for yards!","production_code":"","season_number":1,"show_id":273,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Jimbo and the Jet Set","next_episode_to_air":null,"networks":[{"name":"BBC One","id":4,"logo_path":"/mVn7xESaTNmjBUyUtGNvDQd3CT1.png","origin_country":"GB"}],"number_of_episodes":25,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Jimbo and the Jet Set","overview":"Jimbo and the Jet Set is a British animated cartoon series broadcast in the 1980s, featuring the adventures of the eponymous Jimbo, a talking aeroplane. Created by Maddocks Cartoon Productions, it originally ran for 25 episodes between 1985 and 1986.\n\nThe premise of the cartoon is that Jimbo was originally intended to be a Jumbo Jet, but his designer could not tell the difference between inches and centimetres, resulting in his diminutive size. If Jimbo's designer switched the imperial measurements of the Boeing 747 for metric, the result would have been an aircraft with a fuselage length of 91 ft; this would make Jimbo roughly the length of an early-series Boeing 737.\n\nThe television series features various talking airport-type ground vehicles: Tommy Tow-Truck, Claude Catering, Amanda Baggage, Phil the Fuel Truck, Sammy Steps and Harry Helicopter. Other plane characters appear from time to time, such as Old Timer, a Vickers Wellington bomber who gets into the story while flying to or from an airshow. The story is based at a fictional \"London Airport\", under the command of an irate controller who frequently ends episodes screaming \"I want words with you, Jimbo!\".","popularity":0.6,"poster_path":"/zyPHrhGnnrkYDmwgbxBb84vFPIM.jpg","production_companies":[],"seasons":[{"air_date":"1986-01-06","episode_count":25,"id":867,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":10.0,"vote_count":1}