{"backdrop_path":"/fAay9Y7fGXinpQOWjRiAN0VZXf4.jpg","created_by":[],"episode_run_time":[30],"first_air_date":null,"genres":[],"homepage":"http://www.channel4.com/4car/","id":102,"in_production":true,"languages":["en"],"last_air_date":null,"last_episode_to_air":null,"name":"Driven","next_episode_to_air":null,"networks":[{"name":"Channel 4","id":26,"logo_path":"/hbifXPpM55B1fL5wPo7t72vzN78.png","origin_country":"GB"}],"number_of_episodes":0,"number_of_seasons":0,"origin_country":[],"original_language":"en","original_name":"Driven","overview":"Driven was a motoring television programme launched by Channel 4 in 1998 as a rival to the successful and long-running BBC series Top Gear.\n\nThe style was similar to its rival, but with additional features such as the \"Driven 100\", a road test of three cars in the same class, where each car would be given marks for qualities such as practicality, desirability and cost of ownership. The car with the highest total score would be the winner. The programme launched with the concept that the presenters should interact with each other rather than present items on their own, as was then the case on Top Gear. The first series also featured a \"headquarters\", a racing team truck, set on a former air force base at which cars were put through their paces. These concepts resurfaced in the reborn Top Gear soon after.\n\nOriginally presented by Mike Brewer, James May and Jason Barlow, subsequent series also featured the rally driver Penny Mallory and the racing driver Jason Plato. During the show's run, both James May and Jason Barlow left the show to join the old format of BBC's Top Gear.\n\nFollowing the creation of Fifth Gear and the revival of Top Gear, Driven was cancelled by Channel 4 in 2002. Jason Plato went on to present Fifth Gear, James May joined the newly-relaunched Top Gear, Mike Brewer presented ITV's Pulling Power and Penny Mallory could be seen on ITV4's Used Car Roadshow.","popularity":0.6,"poster_path":"/9vMd3NY8qE6HhC64bjZB6T1NEOY.jpg","production_companies":[],"seasons":[],"status":"Ended","type":"Scripted","vote_average":10.0,"vote_count":1}