{"backdrop_path":null,"created_by":[{"id":1213382,"credit_id":"52533b1919c295794006cb27","name":"Charles Pratt, Jr.","gender":2,"profile_path":null}],"episode_run_time":[60],"first_air_date":"2000-10-04","genres":[{"id":10766,"name":"Soap"},{"id":18,"name":"Drama"}],"homepage":"","id":116,"in_production":false,"languages":["en"],"last_air_date":"2001-04-04","last_episode_to_air":{"air_date":"2001-04-04","episode_number":13,"id":5572,"name":"Someone Wicked This Way Comes","overview":"Peter pays off Maureen, but warns her to stay away for good.  Peter and Samantha travel to her grandfather's winery to ask for his blessing.  He doesn't feel that Peter is the right man for her.  Peter angrily leaves and says the relationship is over.  Samantha later has a change of heart and returns home.  She tells Peter that she loves him, and will marry him in spite of her grandfather's objections.  Maureen ignores Peter's threat and continues to cause trouble.  After an encounter with a high school classmate, Heather admits to Chandler that she has been lying about her past.  She had to change her name to escape an abusive stepfather.  Heather continues to have nightmares, and is terrified when she receives a phone call from the man stalking her in the dreams.  Jack and Gwen sleep together, but Gwen considers their night together a mistake.  Heather tries to pry into their business and spread gossip.  Faith dumps Ethan in favor of her other boyfriend.  Ethan wins her back by follo","production_code":"","season_number":1,"show_id":116,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Titans","next_episode_to_air":null,"networks":[{"name":"NBC","id":6,"logo_path":"/o3OedEP0f9mfZr33jz2BfXOUK5.png","origin_country":"US"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Titans","overview":"Titans is an American prime time soap opera that debuted on October 4, 2000 on NBC. Thirteen episodes were filmed, of which eleven were actually aired. Produced by Aaron Spelling, the series was initially marketed as a \"Dynasty for the new millennium,\" attempting to emulate the style of Spelling's earlier hit series. However, low ratings led NBC to cancel the series before its first season was completed.","popularity":3.035,"poster_path":null,"production_companies":[{"id":7928,"logo_path":null,"name":"NBC Studios","origin_country":""},{"id":15620,"logo_path":null,"name":"Spelling Television","origin_country":""}],"seasons":[{"air_date":"2000-10-04","episode_count":13,"id":347,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}