{"backdrop_path":null,"created_by":[],"episode_run_time":[23,30],"first_air_date":"2005-05-30","genres":[],"homepage":"http://web.archive.org/*/http://channelnine.ninemsn.com.au/section.aspx?sectionid=2187&sectionname=temptation","id":182,"in_production":true,"languages":["en"],"last_air_date":"2006-03-31","last_episode_to_air":{"air_date":"2006-03-31","episode_number":35,"id":11413,"name":"Episode #165","overview":"","production_code":"","season_number":2,"show_id":182,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Temptation","next_episode_to_air":null,"networks":[{"name":"Nine Network","id":66,"logo_path":"/pXibAQSgIIanNkSg68dUooI7IGU.png","origin_country":"AU"}],"number_of_episodes":165,"number_of_seasons":2,"origin_country":["AU"],"original_language":"en","original_name":"Temptation","overview":"Temptation was an Australian game show which premiered on the Nine Network on 30 May 2005. Hosted by Ed Phillips and Livinia Nixon, the show was a remake of Sale of the Century, which aired on Nine in the same timeslot for more than twenty years between 1980 and 2001. Temptation had the same general format of its predecessor, but with several new features and a de-emphasis on the \"shopping\" aspects of the endgame. The show ran until 30 November 2007, when it was placed on hiatus by the network following strong competition from game show Deal or No Deal on the rival Seven Network; during the hiatus, Nine filled the timeslot with episodes of the American sitcom Two and a Half Men. When Ed Phillips made an appearance on The NRL Footy Show he announced \"maybe summer\" would be the return of the show. This statement was accurate, as Temptation returned for a shortened fourth series from 1 December 2008 with unaired episodes which were recorded during 2008. During that time, Ed Phillips was dumped by the Nine Network after his contract expired in November, and Temptation never returned to the schedule. After 23 January 2009, when the show's final episode aired, all Temptation websites were removed, and Two and a Half Men returned to Channel Nine's 7pm schedule.","popularity":0.639,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2005-05-30","episode_count":130,"id":594,"name":"Season 1","overview":"","poster_path":null,"season_number":1},{"air_date":"2006-02-13","episode_count":35,"id":595,"name":"Season 2","overview":"","poster_path":null,"season_number":2}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}