{"backdrop_path":"/gR5LYtXSwErpEQQ0w2jEojKrbbj.jpg","created_by":[{"id":53175,"credit_id":"52534a6f19c29579400f0f10","name":"Mark Schwahn","gender":2,"profile_path":null}],"episode_run_time":[42,60,39,44],"first_air_date":"2003-09-23","genres":[{"id":18,"name":"Drama"}],"homepage":"http://www.cwtv.com/shows/one-tree-hill","id":269,"in_production":false,"languages":["en"],"last_air_date":"2012-04-04","last_episode_to_air":{"air_date":"2012-04-04","episode_number":13,"id":14568,"name":"One Tree Hill","overview":"In the final chapter of One Tree Hill, the tenth anniversary of Tric brings old faces and new possibilities for the Tree Hill family.","production_code":"","season_number":9,"show_id":269,"still_path":"/6W6gxQpYlTtBNYzmf5bHl4ftgKs.jpg","vote_average":0.0,"vote_count":0},"name":"One Tree Hill","next_episode_to_air":null,"networks":[{"name":"The WB","id":21,"logo_path":"/9GlDHjQj9c2dkfARCR3zlH87R66.png","origin_country":"US"},{"name":"The CW","id":71,"logo_path":"/ge9hzeaU7nMtQ4PjkFlc68dGAJ9.png","origin_country":"US"}],"number_of_episodes":187,"number_of_seasons":9,"origin_country":["US"],"original_language":"en","original_name":"One Tree Hill","overview":"Set in the fictional small town of Tree Hill, North Carolina, this teen-driven drama tells the story of two half brothers, who share a last name and nothing else. Brooding, blue-collar Lucas is a talented street-side basketball player, but his skills are appreciated only by his friends at the river court. Popular, affluent Nathan basks in the hero-worship of the town, as the star of his high school team. And both boys are the son of former college ball player, Dan Scott, whose long ago choice to abandon Lucas and his mother Karen, will haunt him long into his life with wife Deb, and their son Nathan.","popularity":20.648,"poster_path":"/jb9CIFdAFxruIHLovcoPAb0Srk6.jpg","production_companies":[{"id":1957,"logo_path":"/nmcNfPq03WLtOyufJzQbiPu2Enc.png","name":"Warner Bros. Television","origin_country":"US"},{"id":2184,"logo_path":null,"name":"Tollin/Robbins Productions","origin_country":""}],"seasons":[{"air_date":"2012-04-04","episode_count":4,"id":858,"name":"Specials","overview":"","poster_path":null,"season_number":0},{"air_date":"2003-09-23","episode_count":22,"id":849,"name":"Season 1","overview":"Aside from a love for hoops, it would seem that Lucas and Nathan are two young men with little in common, but they are bound by the dark secret that they share the same father. Arrogant and assured, Nathan is the star of the high school basketball team and hails from a wealthy family. Quiet and driven, Lucas is the only child of a single working mom. Now the two boys' lives collide when a twist of fate puts Lucas on Nathan's team and the half-brothers compete, not only for control of the court, but also for the heart of Nathan's beautiful girlfriend Peyton.  Years in the making, a deep and bitter conflict slowly unfolds as the two boys struggle to come to terms with who they really are, and a father who has chosen to live vicariously through one son, while ignoring the existence of the other.","poster_path":"/i9S1J3o6XD8oMN198TXXud924yF.jpg","season_number":1},{"air_date":"2004-09-21","episode_count":23,"id":850,"name":"Season 2","overview":"Lucas Scott has left town with his Uncle Keith to start a new life. It's not long, however, before they second thoughts, prompted in part by Dan's recent heart attack and the women they left behind. Peyton and Brooke, both angry that Lucas left without saying goodbye, try to mend their friendship. Meanwhile, Nathan Scott has married Haley in a union received with mixed reactions.","poster_path":"/4V46kN1OewSnnpxF7H9qXMtmOJN.jpg","season_number":2},{"air_date":"2005-10-05","episode_count":22,"id":851,"name":"Season 3","overview":"Summer is coming to an end senior year is right around the corner. Lucas reunites with Brooke after a summer apart. Nathan comes home from basketball camp to find that Haley has decided to return to save their marriage. Meanwhile, Peyton tries to find the truth about Ellie Harp and Dan Scott is on a mission to figure out who set the the dealership on fire.","poster_path":"/rJV6rujR3JuwE9HFDP5u8QcHqBZ.jpg","season_number":3},{"air_date":"2006-09-27","episode_count":21,"id":852,"name":"Season 4","overview":"The inhabitants of Tree Hill have witnessed Lucas' metamorphosis from loner to high school basketball star, Nathan and Haley's troubled marriage and Peyton and Brooke's tumultuous friendship. As the group of high school seniors find themselves dealing with life-altering experiences they will never forget, the adults in Tree Hill continue to deal with the residue of decisions they made years ago.","poster_path":"/6Ql2xhT5kxd4fVmUZW52ckQbAil.jpg","season_number":4},{"air_date":"2008-01-08","episode_count":18,"id":853,"name":"Season 5","overview":"The show leaps forward four years and the Tree Hill gang has graduated from college. Some have found success while others have failed. Some are the same, some are very different. Lucas has written and published a book, Brooke has made it big in the fashion industry, Peyton is pursuing a career in the music business, and Nathan and Haley continue to raise a now older James.","poster_path":"/5DG53dg3aL3wGpUNbo8z14VoGp9.jpg","season_number":5},{"air_date":"2008-09-01","episode_count":24,"id":854,"name":"Season 6","overview":"Lucas Scott embarks on the journey of a lifetime with the woman he chose to love. Nathan Scott continues to work on his comeback as a professional athlete with ambitions to play in the NBA. Brooke's battle with her unscrupulous mother Victoria over the enormously successful apparel line heats up. Haley continues to dream of success in the music business. Skills' and Deb's hook-up threatens to become \"un-hooked.\" Mouth and Millicent wrestle with leaving Tree Hill and Dan's life hangs in the balance.","poster_path":"/hCwfT4Pnswb1YwT9Pg1BVo1JJs9.jpg","season_number":6},{"air_date":"2009-09-14","episode_count":22,"id":855,"name":"Season 7","overview":"Nathan's NBA career is threatened by explosive scandal. Haley faces a family tragedy. Brooke thinks she's found true love with Julian - until a Hollywood hottie decides he's just her type. Dan leaves the slammer for the media spotlight and a sexy young wife. Millie spirals into self-destruction, breaking Mouth's heart.","poster_path":"/ecPpmsEOY1HiG96XJr0JiHZawt.jpg","season_number":7},{"air_date":"2010-09-14","episode_count":22,"id":856,"name":"Season 8","overview":"Brooke Davis happier than ever. Recently engaged to Julian, her wedding will be the captivating affair one might expect from a young, beautiful, successful fashion designer. As Nathan Scott prepares for his second season in the NBA, the Scott family is expecting their second child and Haley feels as though the baby will be a girl. How will she balance her pregnancy while raising Jamie and pursuing her music career? Also, Quinn and Clay's lives hang in the balance, the victims of a brutal attack which affects all of their friends and family.","poster_path":"/azflA0AVaiYSUkZ12wQS46Op1R2.jpg","season_number":8},{"air_date":"2012-01-11","episode_count":13,"id":857,"name":"Season 9","overview":"In the last season of the series, Julian Baker and Brooke Davis juggle parenthood to their two sons and their very young careers. Haley James Scott adapts to life with a second child, an increasingly independent Jamie, a busy café to run, and a husband travelling more for work. Clay Evans, Nathan's friend and business partner, found love and happiness with Quinn James. Is a wedding in store for the couple? Or Mouth and Millicent? And what's to become of Alex Dupré  and Chase and their burgeoning romance?","poster_path":"/t5xio26zpVpumXCemCY0LuTlnoC.jpg","season_number":9}],"status":"Ended","type":"Scripted","vote_average":7.6,"vote_count":171}