{"backdrop_path":"/x0SwyseembrA3X3OpGp2St8FfGB.jpg","created_by":[],"episode_run_time":[90],"first_air_date":"1993-05-05","genres":[{"id":10768,"name":"War & Politics"},{"id":10759,"name":"Action & Adventure"}],"homepage":"","id":225,"in_production":false,"languages":["en"],"last_air_date":"2008-11-09","last_episode_to_air":{"air_date":"2008-11-09","episode_number":2,"id":13054,"name":"Sharpe's Peril: Part 2","overview":"It's India, 1818 and Lt Col Richard Sharpe and Sergeant Major Patrick Harper are travelling across India, escorting the beautiful Marie-Angelique Bonnet to meet her fiancée. While in bandit-plagued badlands, they come across the very dregs of the Crown's troops; an ill disciplined, rag-tag unit led by boy soldier Beauclare. As Sharpe and company sit down to have dinner with their hosts, the camp comes under attack by the notorious bandit Chitu. As the dust settles, it becomes apparent there have been many casualties and Sharpe realises that he is the only person now capable of getting this wagon train to the safety of the next army garrison. Little does Sharpe know that the adventure has only just begun and that he has inadvertently stumbled across a massive opium trafficking ring...","production_code":"","season_number":7,"show_id":225,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Sharpe","next_episode_to_air":null,"networks":[{"name":"ITV","id":9,"logo_path":"/5Rmw4ViYcjW14PCdOyjsue9eK99.png","origin_country":"GB"}],"number_of_episodes":18,"number_of_seasons":7,"origin_country":["GB"],"original_language":"en","original_name":"Sharpe","overview":"Sharpe is a British series of television dramas starring Sean Bean as Richard Sharpe, a fictional British soldier in the Napoleonic Wars. Sharpe is the hero of a number of novels by Bernard Cornwell; most, though not all, of the episodes are based on the books. Produced by Celtic Films and Picture Palace Films for the ITV network, the series was shot mainly in Turkey and the Crimea, although some filming was also done in England, Spain and Portugal.\n\nThe series originally ran from 1993 to 1997. In 2004, as part of ITV's new set of drama, ITV announced that it intended to produce new episodes of Sharpe, in co-production with BBC America, loosely based on his time in India, with Sean Bean continuing his role as Sharpe. Sharpe's Challenge is a two-part adventure; part one premiered on ITV on 23 April 2006, with part two being shown the following night. With more gore than earlier episodes, the show was broadcast by BBC America in September 2006.\n\nAt a book signing in Bath on 11 October 2006, Bernard Cornwell revealed that there were plans by ITV to film two more episodes. Filming was supposed to start in April, but was postponed due to the resignation of ITV's chief executive, at which point production was pushed back to September. However, Sean Bean was unavailable due to other commitments, so production was postponed once more. When asked about the stories, Cornwell said that he believed that they were producing two new stories specially for television. It was announced that filming Sharpe's Peril, produced by Celtic Film/Picture Palace, began on 3 March 2008 in India. The first part was broadcast on ITV on 2 November 2008 with the second part shown a week later. Sharpe's Challenge and Sharpe's Peril were broadcast in the US in 2010 as part of PBS' Masterpiece Classic season.","popularity":10.09,"poster_path":"/adoq3P4qCeDquGXjtcwDDXECESH.jpg","production_companies":[],"seasons":[{"air_date":"1997-10-13","episode_count":3,"id":734,"name":"Specials","overview":"","poster_path":null,"season_number":0},{"air_date":"1993-05-05","episode_count":2,"id":731,"name":"Season 1","overview":"","poster_path":null,"season_number":1},{"air_date":"1994-05-25","episode_count":3,"id":733,"name":"Season 2","overview":"","poster_path":"/oGyW6tQ1Ur4SxUVeRNlQ23Qv3pQ.jpg","season_number":2},{"air_date":"1995-04-12","episode_count":3,"id":730,"name":"Season 3","overview":"","poster_path":"/1fyCYSLaio1d2KssRxWiybjE3yZ.jpg","season_number":3},{"air_date":"1996-05-01","episode_count":3,"id":728,"name":"Season 4","overview":"","poster_path":"/ngIA7i4lxu9or7wU4dIgu6jp057.jpg","season_number":4},{"air_date":"1997-05-07","episode_count":3,"id":732,"name":"Season 5","overview":"","poster_path":"/cHysxuIkR8FLzgmnA1SdTgoH7tO.jpg","season_number":5},{"air_date":"2006-04-23","episode_count":2,"id":729,"name":"Season 6","overview":"","poster_path":null,"season_number":6},{"air_date":"2008-11-02","episode_count":2,"id":735,"name":"Season 7","overview":"","poster_path":null,"season_number":7}],"status":"Ended","type":"Scripted","vote_average":7.7,"vote_count":8}