{"backdrop_path":null,"created_by":[],"episode_run_time":[24],"first_air_date":"1986-09-21","genres":[{"id":16,"name":"Animation"}],"homepage":"","id":218,"in_production":false,"languages":["en"],"last_air_date":"1986-12-14","last_episode_to_air":{"air_date":"1986-12-14","episode_number":13,"id":12803,"name":"Earth's Darkest Hour","overview":"Three months have passed since the last Inhumanoid attack. Derek and Stella Bright are enjoying their newlywed status as a celebrity couple even as the other members of Earth Corps increasingly find themselves basking in the media spotlight — except Auger, who seems to have been overlooked by fortune's calling.\n\nSenator Masterson's declared candidacy for the presidential race is met by a hostile public reception, prompting Blackthorne and the Inhumanoids to conspire to use intimidation tactics to terrify the other presidential contenders into withdrawing. In reaction, Auger decides to enter the race himself, challenging Masterson's undeserving political record. The Inhumanoids try to bolster Masterson's credibility with a staging of faux heroics, but when Auger wins the election regardless, he is immediately kidnapped by the enraged Inhumanoids, who invite all opponents to attempt a rescue in a final grand confrontation.\n\nEarth Corps and a battalion dubbed Delta Force motor to Skellweb, fighting their way through a phalanx of skeletal warriors and dispensing with Langastoid mercenaries while the Redwood army overwhelms Tendril, and Granite warriors flatten Metlar's statue legion. D'Compose makes a quick exit as the Mutores and Earth defense forces finally advance to face Metlar's molten fury. Magnokor is able to magnetically subdue him, until Blackthorne intrudes with a delay that imperils Auger's life. Luckily, Tank and Sabre Jet arrive at the eleventh hour to save the day. In light of their triumph, Auger and the Earth Corps team renew their pledge to remain together to guard against danger from the Inhumanoids.","production_code":"","season_number":1,"show_id":218,"still_path":"/pP3hLCht8F0aYHT7u8FJN1zKQqB.jpg","vote_average":0.0,"vote_count":0},"name":"Inhumanoids","next_episode_to_air":null,"networks":[],"number_of_episodes":14,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Inhumanoids","overview":"Inhumanoids was an animated series and Hasbro toy property in 1986. In the tradition of other Hasbro properties such as Transformers and G.I. Joe, the show was produced by Sunbow and Marvel Productions and animated in Japan by Toei Animation. Inhumanoids tells the story of the scientist-hero group, Earth Corps, as they battle a trio of subterranean monsters called the Inhumanoids with the aid of elemental beings, the Mutores.","popularity":1.201,"poster_path":"/wzLyDAdkT0yUVQycSeZuosgbjSA.jpg","production_companies":[],"seasons":[{"air_date":"1986-09-21","episode_count":14,"id":712,"name":"Season 1","overview":"","poster_path":"/1FancfJzfJEmha5edIQbhZa9Pu9.jpg","season_number":1}],"status":"Ended","type":"Scripted","vote_average":7.3,"vote_count":3}