{"backdrop_path":"/dWl6Nez0OI4Sr2hImLSqfiODmwW.jpg","created_by":[],"episode_run_time":[70],"first_air_date":"2004-07-11","genres":[{"id":18,"name":"Drama"}],"homepage":"http://www.pbs.org/wgbh/masterpiece/islandatwar/index.html (US)","id":450,"in_production":false,"languages":["en"],"last_air_date":"2004-08-15","last_episode_to_air":{"air_date":"2004-08-15","episode_number":6,"id":22776,"name":"Unusual Successes","overview":"June is singing at the 50/50 club where a German Officer accompanies her on the piano.  A local boy accuses her of being a collaborator and throws a glass at her.  She is hit in the face.  June goes to the photo shop and discovers her sister is in love with Bernhardt.   Walker finds the man responsible for hurting June and beats him to death with the butt of a pistol.\n\nJames Dorr confesses to the La Salles that he was responsible for their sons death.  He then gives Philip as much information as possible about the Germans for when he returns to England.\n\nWilf offers his boat for Philip to escape in.  Zelda also wishes to escape and is offered a chance to go on the boat.  Wilf takes Wimmel fishing in order to leave his boat by the cliffs but the plan goes awry. Wilfs son shoots at Wimmel, using a gun bought from a drunken German officer, believing his father to be in danger.\n\nPhilip and Zelda try to escape later that night but are intercepted.  Zelda manages to escape unnoticed back to Cas","production_code":"","season_number":1,"show_id":450,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Island at War","next_episode_to_air":null,"networks":[{"name":"ITV","id":9,"logo_path":"/5Rmw4ViYcjW14PCdOyjsue9eK99.png","origin_country":"GB"}],"number_of_episodes":6,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Island at War","overview":"Island at War is a British television series that tells the story of the German Occupation of the Channel Islands. It primarily focuses on three local families: the upper class Dorrs, the middle class Mahys and the working class Jonases, and four German officers. The fictional island of St. Gregory serves as a stand-in for the real-life islands Jersey and Guernsey, and the story is compiled from the events on both islands.\n\nProduced by Granada Television in Manchester, Island at War had an estimated budget of £9,000,000 and was filmed on location in the Isle of Man from August 2003 to October 2003. When the series was shown in the UK, it appeared in six 70-minute episodes.","popularity":1.708,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2004-07-11","episode_count":6,"id":1310,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Miniseries","vote_average":7.7,"vote_count":3}