{"backdrop_path":null,"created_by":[{"id":170497,"credit_id":"525341ff19c29579400a7573","name":"Norman Lear","gender":2,"profile_path":null}],"episode_run_time":[30],"first_air_date":"1977-07-04","genres":[],"homepage":"","id":169,"in_production":true,"languages":[],"last_air_date":"1977-09-30","last_episode_to_air":{"air_date":"1977-09-30","episode_number":65,"id":10723,"name":"Save \"Fernwood 2Night\" Telethon","overview":"Barth and Jerry stage a telethon to save the show. Final episode of the series.  Continues the next summer as \"\"America 2Night\"\".","production_code":"","season_number":1,"show_id":169,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Fernwood 2 Night","next_episode_to_air":null,"networks":[],"number_of_episodes":65,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Fernwood 2 Night","overview":"Fernwood 2 Night was a comedic television program that ran from July 1977 – September 1977. It was created by Norman Lear and produced by Alan Thicke as a spin-off/summer replacement from Mary Hartman, Mary Hartman. It was a parody talk show, hosted by Barth Gimble and sidekick/announcer Jerry Hubbard, complete with a stage band, Happy Kyne and His Mirthmakers. Barth was the twin brother of Garth Gimble from Mary Hartman.\n\nLike Mary Hartman, Fernwood 2 Night was set in the fictional town of Fernwood, Ohio. The show satirized real talk shows as well as the sort of fare one might expect from locally-produced, small-town, midwestern American television programming. Well-known actors usually appeared playing characters or a contrivance had to be written for the celebrity to appear as themselves.\n\nAfter one season of Fernwood, the producers revamped the show the following year as America 2-Night. In this second version, Barth and Jerry's show moved to California and was broadcast nationally on the fictional UBS network, whose slogan was \"We put U before the BS\". This change allowed the show to now have well-known actors on the show as themselves.","popularity":4.374,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"1977-07-04","episode_count":65,"id":558,"name":"Fernwood 2night season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":9.0,"vote_count":1}