{"backdrop_path":"/ic6IPDg0YZ4rCXvzuBUMVnv4Qkk.jpg","created_by":[{"id":73037,"credit_id":"52533eac19c2957940087d89","name":"Glen Charles","gender":2,"profile_path":null},{"id":73038,"credit_id":"52533eac19c2957940087d83","name":"Les Charles","gender":2,"profile_path":null},{"id":157437,"credit_id":"52533ead19c2957940087d8f","name":"James Burrows","gender":2,"profile_path":null}],"episode_run_time":[24,30],"first_air_date":"1982-09-30","genres":[{"id":35,"name":"Comedy"}],"homepage":"","id":141,"in_production":false,"languages":["en"],"last_air_date":"1993-05-20","last_episode_to_air":{"air_date":"1993-05-20","episode_number":28,"id":7863,"name":"One for the Road, Part 3","overview":"Whilst watching the National Cable Ace Awards, the gang sees ex-waitress Diane Chambers winning the award for best writing in a mini-series. This leads to Sam calling Diane to congratulate her, and to find out that she is married and has children. Sam tells her Diane that he too has a wife and kids, and invites Diane and her husband to visit them.\n\nSam strongly believes Diane is lying and becomes really shocked when she walks into Cheers the following day to meet Mrs Malone. Meanwhile Rebecca's boyfriend Don proposes to her and she accidently says no, ends up heartbroken and agrees to play Sam's wife to fool Diane.\n\nSam and Rebecca have dinner with Diane and her husband, Reed Manchester. During the dinner Don arrives and proposes to her again, and this time she manages to say yes! They leave the dinner, and Sam thinks he must look like a fool. Then Diane's husband turns out to be a fake when *his* husband Kevin appears! Now alone, Sam and Diane reminisce about the good old times, and end","production_code":"","season_number":11,"show_id":141,"still_path":"/i8YqvJDA88muLd7anZ76peAKhXA.jpg","vote_average":0.0,"vote_count":0},"name":"Cheers","next_episode_to_air":null,"networks":[{"name":"NBC","id":6,"logo_path":"/o3OedEP0f9mfZr33jz2BfXOUK5.png","origin_country":"US"}],"number_of_episodes":273,"number_of_seasons":11,"origin_country":["US"],"original_language":"en","original_name":"Cheers","overview":"The story about a blue-collar Boston bar run by former sports star Sam Malone and the quirky and wonderful people who worked and drank there.","popularity":35.976,"poster_path":"/nD1ZQBKbgKSmKcrAkWTofohsScj.jpg","production_companies":[{"id":9223,"logo_path":"/1nfcdPtyI7j9Err6cfrXNvlONEK.png","name":"Paramount Television","origin_country":"US"},{"id":55751,"logo_path":null,"name":"Charles/Burrows/Charles Productions","origin_country":""}],"seasons":[{"air_date":"1990-11-08","episode_count":26,"id":428,"name":"Specials","overview":"","poster_path":"/dWPrf94i1QvnezGbWGo0cweiNIT.jpg","season_number":0},{"air_date":"1982-09-30","episode_count":22,"id":419,"name":"Season 1","overview":"The first season of Cheers is an American television situation comedy series that originally aired in the United States on NBC between September 30, 1982, and March 31, 1983, in 22 episodes. The show was created and produced by director James Burrows and writers Glen and Les Charles, who previously worked on Taxi, another sitcom. Cheers was produced by Charles Burrows Charles Productions in association with Paramount Television. The concept and production design of the show were inspired by a public house in Boston, the Bull \u0026 Finch, which is now called Cheers Beacon Hill.\n\nWhen it was first broadcast, critics praised the series as intelligent, sophisticated, cleverly written, well-cast, and well-timed. However, the Nielsen ratings for its original runs were very low. Typically, low ratings result a show's cancellation, but before the season finale aired, the network renewed it for another season. Reruns of season 1 scored higher ratings than its first airing and the series earned award recognitions, including five Emmy Award wins in 1983. In later years, this season has still elicited positive reviews and is currently available on DVD.","poster_path":"/ngfSm75OhIQhmSoOMUQhCBaho9O.jpg","season_number":1},{"air_date":"1983-09-29","episode_count":22,"id":420,"name":"Season 2","overview":"The second season of Cheers, an American situation comedy television series, originally aired on NBC in the United States between September 29, 1983, and May 10, 1984, with 22 episodes. The show was created by director James Burrows and writers Glen and Les Charles, and was produced by Charles Burrows Charles Productions in association with Paramount Television. The second season has been released on DVD as a four-disc set.\n\nThe show won Emmy Awards, including one for Outstanding Comedy Series, in 1983 and 1984. Critical reception was mostly positive, with negative commentary about the extended romance between Sam and Diane.","poster_path":"/1OWeoseFleLwSvs124FRUIcs7Ii.jpg","season_number":2},{"air_date":"1984-09-27","episode_count":25,"id":418,"name":"Season 3","overview":"The third season of Cheers, an American television sitcom, originally aired on NBC in the United States between September 27, 1984, and May 9, 1985. The show was created by director James Burrows and writers Glen and Les Charles under production team Charles Burrows Charles Productions in association with Paramount Television. The third season is available on DVD in a four-disc set.\n\nThe season marks major events that affected, or could have affected, the show. Kelsey Grammer made his debut as psychiatrist Frasier Crane, intended as part of a love triangle with Sam and Diane for the season. Actresses Rhea Perlman and Shelley Long were pregnant; Perlman's pregnancy was written into her character, while Long's was hidden to avoid effects on her character. This was the final season for Nicholas Colasanto as Coach Ernie Pantusso; Colasanto died of a heart condition which worsened during production, contributing to his absence from a number of episodes before his death in February 1985.","poster_path":"/A3CAuUAYzXRzZSTgS0yp1rp6fpU.jpg","season_number":3},{"air_date":"1985-09-26","episode_count":26,"id":417,"name":"Season 4","overview":"The fourth season of Cheers, an award-winning American television sitcom, originally aired on NBC in the United States between September 26, 1985, and May 15, 1986, as part of the network's Must See TV Thursday lineup. This season marks Woody Harrelson's television debut as Woody Boyd, replacing Coach Ernie Pantusso when actor Nicholas Colasanto died during filming of the prior season. The show was created by director James Burrows and writers Glen and Les Charles, under production team Charles Burrows Charles Productions, in association with Paramount Television.","poster_path":"/oezlLP1M8D1pDSYTgJBiz6tyB4Y.jpg","season_number":4},{"air_date":"1986-09-25","episode_count":26,"id":422,"name":"Season 5","overview":"The fifth season of Cheers, an award-winning American television sitcom, originally aired on NBC in the United States between September 25, 1986, and May 7, 1987. This season marks the departure of Shelley Long as Diane Chambers, bringing an end to the Sam and Diane relationship, though she would return for the series finale. The show was created by director James Burrows and writers Glen and Les Charles under production team Charles Burrows Charles Productions, in association with Paramount Television.","poster_path":"/ngpaQyonflqSImdwGcyG0SSkbaR.jpg","season_number":5},{"air_date":"1987-09-24","episode_count":25,"id":425,"name":"Season 6","overview":"The sixth season of Cheers, an award-winning American television sitcom, originally aired on NBC in the United States between September 24, 1987 and May 7, 1988. This season highlights the debut of Kirstie Alley as Rebecca Howe. The show was created by director James Burrows and writers Glen and Les Charles under production team Charles Burrows Charles Productions, in association with Paramount Television.","poster_path":"/cen323HpbrMmhPPjJgSkfIJCbxe.jpg","season_number":6},{"air_date":"1988-10-27","episode_count":22,"id":424,"name":"Season 7","overview":"The seventh season of Cheers, an award-winning American television sitcom, originally aired on NBC in the United States between October 27, 1988 and May 4, 1989. The show was created by director James Burrows and writers Glen and Les Charles under production team Charles Burrows Charles Productions, in association with Paramount Television.","poster_path":"/obKPG8J1jBlifeBmg7UquMucBpk.jpg","season_number":7},{"air_date":"1989-09-21","episode_count":26,"id":423,"name":"Season 8","overview":"The eighth season of Cheers, an award-winning American television sitcom, originally aired on NBC in the United States between September 21, 1989 and May 3, 1990. The show was created by director James Burrows and writers Glen and Les Charles under production team Charles Burrows Charles Productions, in association with Paramount Television.","poster_path":"/jh5aa6GeIh3M6uRFkSF0wkt5CQX.jpg","season_number":8},{"air_date":"1990-09-20","episode_count":25,"id":426,"name":"Season 9","overview":"","poster_path":"/a7YIlMaaspyxamI1MsbsxaXvcMO.jpg","season_number":9},{"air_date":"1991-09-19","episode_count":26,"id":421,"name":"Season 10","overview":"","poster_path":"/eSnI8AFXXYfCF6syeNIgUZQK7c9.jpg","season_number":10},{"air_date":"1992-09-24","episode_count":28,"id":427,"name":"Season 11","overview":"","poster_path":"/2LeF1dlRdO4d6LUO6f9FeO7pcgt.jpg","season_number":11}],"status":"Ended","type":"Scripted","vote_average":7.7,"vote_count":273}