{"backdrop_path":"/pptfo6vIMDAdJ7HsF4mTPwad3y6.jpg","created_by":[{"id":1212604,"credit_id":"525334d319c2957940032d43","name":"Jonathan Murray","profile_path":null},{"id":1212605,"credit_id":"525334d419c2957940032d4b","name":"Mary-Ellis Bunim","profile_path":null}],"episode_run_time":[42],"first_air_date":"1998-06-01","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.mtv.com/shows/the-challenge-total-madness","id":62,"in_production":true,"languages":["en"],"last_air_date":"2020-07-01","last_episode_to_air":{"air_date":"2020-07-01","episode_number":14,"id":2305507,"name":"Your Time is Gonna Come","overview":"Aneesa worries that her Red Skull may be in jeopardy when players wonder if she has what it takes to run a Final. Fessy makes a questionable move against his alliance. A nighttime challenge and another double elimination shock.","production_code":"","season_number":35,"show_id":62,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"The Challenge","next_episode_to_air":{"air_date":"2020-07-08","episode_number":15,"id":2320425,"name":"Crash Into Me","overview":"","production_code":"","season_number":35,"show_id":62,"still_path":null,"vote_average":0.0,"vote_count":0},"networks":[{"name":"MTV","id":33,"logo_path":"/e9GMyvaguUc36ktS7iSFYP0WLKa.png","origin_country":"US"}],"number_of_episodes":486,"number_of_seasons":35,"origin_country":["US"],"original_language":"en","original_name":"The Challenge","overview":"Each Challenge pits numerous cast members from past seasons of reality shows against each other, dividing them into two separate teams according to different criteria, such as gender, which show they first appeared on, whether or not they're veterans or rookies on the show, etc. The two teams compete in numerous missions in order to win prizes and advance in the overall game.","popularity":10.075,"poster_path":"/vmoLHBmaqraxI8DG24tj5mLJTBx.jpg","production_companies":[{"id":59050,"logo_path":"/qUICKfuADjaDYJWlPRRIcVrJHq3.png","name":"Bunim-Murray Productions (BMP)","origin_country":"US"}],"seasons":[{"air_date":"2014-12-30","episode_count":14,"id":64189,"name":"Specials","overview":"","poster_path":null,"season_number":0},{"air_date":null,"episode_count":5,"id":138,"name":"All Stars","overview":"Road Rules: All Stars is the first season of the MTV reality game show, The Challenge. Unlike later seasons the show followed alumni of The Real World as they went on a typical Road Rules-type adventure around the United States in a non-competitive format. It is the only season without the term Challenge in its title. The season premiered on June 1st, 1998.","poster_path":null,"season_number":1},{"air_date":"1998-11-09","episode_count":6,"id":136,"name":"Real World vs. Road Rules","overview":"Real World/Road Rules Challenge is the 2nd season of the MTV reality game show, The Challenge. The season is directly subsequent to Road Rules: All Stars.\n\nThe season marked the first time in which \"Real World/Road Rules Challenge\" would be used as the show's main title. In addition, it's one of two seasons absent of a subtitle, a trend that wouldn't truly emerge until the show's 4th season.\n\nIt is the first six-on-six Challenge in the series. The teams traveled via tour bus and RV starting in San Francisco, ending in Universal City, California, competing in different individual challenges. The winning team had the right to travel in a tour bus, while the losing team had to travel in an RV. Each time a team won an individual challenge, they won the right to spend time in a \"money machine\". The \"money machine\", set up outside Universal Studios Hollywood in Universal City, California was a huge wind chamber that contained up to $150,000. Whatever the casts could keep on them, they were guaranteed to keep. This season also featured an additional challenge where the two teams competed over possession of a teddy bear. Whichever team had the teddy bear in their possession at an unknown, predetermined point in the challenge, would win the additional challenge.","poster_path":null,"season_number":2},{"air_date":"2000-01-17","episode_count":11,"id":127,"name":"Challenge 2000","overview":"Real World/Road Rules Challenge 2000 is the 3rd season of the MTV reality game show, The Challenge. The season is directly subsequent to Real World/Road Rules Challenge the season.\n\nReal World/Road Rules Challenge 2000 is the second six-on-six The Challenge in the series. The teams traveled via tour bus starting in Las Vegas, Nevada then moving to the eastern U.S., ending in Miami, Florida after competing in different individual challenges. Each time a team won an individual challenge, they won $10,000. After each mission won, the winning team would invest those 10K in the product of their choice through E-Trade. At the end, the winning team also won any money won in the stock market. The last mission would be for the right to keep the money collected in the pot, an additional cash prize and a car. This season also featured an additional challenge where the two teams had to give up smoking for the duration of filming. If any cast member on either team were caught smoking, their cast would lose the additional challenge.","poster_path":null,"season_number":3},{"air_date":"2001-01-09","episode_count":18,"id":129,"name":"Extreme Challenge","overview":"Extreme Challenge is the 4th season of the MTV reality game show, The Challenge. The season is directly subsequent to Real World/Road Rules Challenge 2000.\n\nExtreme Challenge is the first season that adorned the show with a subtitle, the series having begun a new trend of titling each season based off its format and theme. To date, it's also the only season in which the season title alters the show title, through the insertion of \"Extreme\" between \"Real World/Road Rules\" and \"Challenge.\"\n\nExtreme Challenge consisted of the third and final six-on-six Challenge. The casts were split up into two different six-person teams, one representing The Real World and the other representing Road Rules. The teams traveled via tour bus in the eastern U.S. and Europe competing in different individual challenges. Each time a team won an individual challenge, money would be added to an E-Trade account. Each time they won a challenge, they had the chance to invest those winnings in the stock market for the duration of the challenge. The last mission would be for the right to keep the money collected in the pot, an additional cash prize, and a car.","poster_path":null,"season_number":4},{"air_date":"2002-02-04","episode_count":16,"id":135,"name":"Battle of the Seasons","overview":"Real World/Road Rules Challenge: Battle of the Seasons is the fifth season of the MTV reality game show, The Challenge (at the time known as Real World/Road Rules Challenge). The season is directly subsequent to Extreme Challenge.\n\nBattle of the Seasons premiered in early 2002 and took place in Cabo San Lucas, Mexico. In each episode, the cast competed in a challenge, and the top three Real World and top three Road Rules teams would become the \"Inner Circle\" and have the power to vote off teams. The \"Inner Circle\" was determined by a cumulative score that would be tallied on a leader board. The final six teams would compete for a final prize worth $300,000.","poster_path":null,"season_number":5},{"air_date":"2002-12-30","episode_count":19,"id":132,"name":"Battle of the Sexes","overview":"Battle of the Sexes is the 6th season of the MTV reality game show, The Challenge. The season is directly subsequent to the first Battle of the Seasons. Battle of the Sexes featured cast members from The Real World and Road Rules. The cast stayed in the Round Hill Hotel and Villa Resort near Montego Bay, Jamaica. The show premiered on December 30, 2002 and concluded on May 12, 2003.\n\nThis is the first edition of the Battle of the Sexes series, with Battle of the Sexes 2 following in 2004–2005.","poster_path":null,"season_number":6},{"air_date":"2003-09-22","episode_count":19,"id":125,"name":"The Guantlet","overview":"The Gauntlet is the 7th season of the MTV reality game show, The Challenge. The season is directly subsequent to Battle of the Sexes. The Gauntlet featured 28 castmates competing in missions with an immunity life-saver awarded to the best individual performer. Each team would then select a player from their team to go into the Gauntlet elimination challenge. This challenge was held in Telluride, Colorado. It was hosted by Jonny Moseley.\n\nThis is the first edition of the Gauntlet series, with The Gauntlet 2 following in 2005–2006 and The Gauntlet III following in 2008.","poster_path":null,"season_number":7},{"air_date":"2004-02-02","episode_count":18,"id":134,"name":"The Inferno","overview":"The Inferno is the 8th season of the MTV reality game show, The Challenge. The season is directly subsequent to The Gauntlet.\n\nThe Inferno aired in 2004. The season was composed of twenty cast members, and took place in Acapulco, Mexico. In this challenge, the winning teams would receive a prize at the end of each mission. They would then nominate two players from their team to the Inferno elimination challenge. Unlike The Gauntlet, there would be another challenge with an immunity life-saver up for grabs before the Inferno. Each team then selected one of the two nominees from the opposing team to go into the Inferno.\n\nThis is the first edition of The Inferno series, with The Inferno II following in 2005 and The Inferno 3 following in 2007.","poster_path":null,"season_number":8},{"air_date":"2004-10-04","episode_count":19,"id":120,"name":"Battle of the Sexes II","overview":"Battle of the Sexes 2 is the 9th season of the MTV reality game show, The Challenge. The season is directly subsequent to The Inferno.\n\nBattle of the Sexes 2 is the first sequel season of The Challenge, representing the sequel to the show's 6th season, Battle of the Sexes. Battle of the Sexes 2 premiered on October 4, 2004, and concluded on January 31, 2005. The Challenge took place in Santa Fe, New Mexico. Before each challenge, every team would choose three leaders. If the team won, those leaders got to vote off anyone else; if the team lost, one of those leaders would be voted off. No life-shields were used during this season.","poster_path":null,"season_number":9},{"air_date":"2005-02-28","episode_count":19,"id":124,"name":"The Inferno II","overview":"The Inferno II is the 10th season of the MTV reality game show, The Challenge. The season is directly subsequent to Battle of the Sexes 2.\n\nThe Inferno II is the second of The Inferno series, with the original Inferno airing in 2004, and The Inferno 3 following in 2007. The show aired in 2005, and took place in Manzanillo, Mexico. This challenge was the same as The Inferno, except this time each team was allowed to choose only one \"Inferno nominee\" from the opposite team. This nominee had to win the \"life shield\" to save him or herself. The contestants in this challenge were grouped into two teams of \"Good Guys\" and \"Bad Asses\", representing the \"heroes\" and \"villains\" of their respective seasons.","poster_path":null,"season_number":10},{"air_date":null,"episode_count":7,"id":119,"name":"The Gauntlet II","overview":"The Gauntlet II is the 11th season of the MTV reality game show, The Challenge. The season is directly subsequent to The Inferno II.\n\nThe Gauntlet II marked T. J. Lavin's first time presenting the series, regularly hosting the program from this season forward. Prior seasons only used temporary hosts. The season is the second in the Gauntlet series, with the original Gauntlet airing in 2003–2004 and The Gauntlet III following in 2008.\n\nThe Gauntlet II aired in late 2005 and into 2006 with 32 contestants and took place in Trinidad and Tobago. The teams were designated Veterans and Rookies, based on the number of prior Challenge seasons on which each cast member had competed. Those on the Veterans team had been on at least two prior seasons, and those on the Rookies team had been on fewer than two seasons. For this season, a male and female captain were determined at the beginning of the season. After each team challenge, the losing team captain was sent to the \"Gauntlet\", where they would face an opponent of the same sex and same team who was voted into the Gauntlet by the respective team. Gauntlets alternated between \"Male Gauntlets\" and \"Female Gauntlets\".","poster_path":null,"season_number":11},{"air_date":null,"episode_count":7,"id":123,"name":"Fresh Meat","overview":"Fresh Meat is the 12th season of the MTV reality game show, The Challenge.\n\nFresh Meat is a season that made history on The Challenge by being the first season to include previously unknown contestants as part of the cast. Previous to Fresh Meat, all seasons functioned solely by the program's trademark: strictly using contestants that were previously cast on past seasons of The Real World or Road Rules. To date, Fresh Meat's most notable debuting contestants who've both continued on in further seasons of the show and won Challenge seasons are: Kenny Santucci, Evelyn Smith, and Evan Starkman.\n\nFilmed in Australia, Fresh Meat featured two-player teams; each team had an alumnus of The Real World or Road Rules partnered with a newcomer to the Challenge. This is the first edition of the Fresh Meat series, with Fresh Meat II following in 2010.","poster_path":null,"season_number":12},{"air_date":"2006-10-12","episode_count":17,"id":128,"name":"The Duel","overview":"The Duel is the 13th season of the MTV reality game show, The Challenge. The season is directly subsequent to Fresh Meat.\n\nThe Duel took place in Búzios, Brazil, with former cast members from MTV series The Real World and Road Rules competing, along with several cast members from the previous Challenge, Fresh Meat. The host of The Duel was T. J. Lavin.\n\nThe season differed from previous Challenge seasons in that no teams were assigned, as it was every man and woman for themselves. The surviving male and female cast member would win $150,000 each. The season was watched by a total of 83 million viewers. The Duel premiered on October 12, 2006, and concluded on January 18, 2007.\n\nThis is the first edition of The Duel series, with The Duel II following in 2009.","poster_path":null,"season_number":13},{"air_date":null,"episode_count":5,"id":126,"name":"The Inferno III","overview":"The Inferno 3 is the 14th season of the MTV reality game show, The Challenge. The season is directly subsequent to The Duel.\n\nThe Inferno 3 marked the show's first trilogy, the third of the Inferno series, continuing on from The Inferno and The Inferno II. Filming took place in Cape Town, South Africa, with cast members from The Real World, Road Rules and the Fresh Meat challenge competing. The teams were in the format of The Inferno II, \"Good Guys\" versus \"Bad Asses.\" Contrary to the previous Inferno shows, the Lifesaver competitions have been limited to gender only winners, as for the male Inferno days, only males will be able to win it and vice versa. The season premiered on Tuesday April 10, 2007 on MTV.\n\nThere were $400,000 in prizes.","poster_path":null,"season_number":14},{"air_date":"2008-01-23","episode_count":10,"id":118,"name":"The Gauntlet III","overview":"The Gauntlet III is the 15th season of the MTV reality game show, The Challenge. The season is directly subsequent to The Inferno 3.\n\nBeing the third in The Gauntlet series, The Gauntlet III marked the show's 2nd trilogy, continuing on from The Gauntlet and The Gauntlet 2. The season was filmed in Puerto Vallarta, Mexico, with former cast members from The Real World and Road Rules competing, along with several cast members from the Fresh Meat challenge. This season was in the format of two teams: Veterans vs. Rookies, with a format similar to The Gauntlet 2. The contestants on the Veterans team had been on at least two prior seasons of the Challenge, and the contestants on the Rookies team had been on fewer than two prior seasons.","poster_path":null,"season_number":15},{"air_date":"2008-09-16","episode_count":9,"id":137,"name":"The Island","overview":"The Island is the 16th season of the MTV reality game show, The Challenge. The season is directly subsequent to The Gauntlet III.\n\nLike previous seasons of The Challenge, The Island featured cast members from various past seasons of The Real World and Road Rules, of which The Challenge was a spun off from, competing along with several cast members from the Fresh Meat challenge. This season featured the contestants \"stranded\" on an island off the coast of Panama, where the cast competed for a buried treasure chest filled with $300,000 USD in gold. Unlike in previous Challenges, the cast was not housed in a luxurious dwelling, but was \"forced\" to improvise and \"work\" for the basic necessities of food and shelter, as on the TV series Survivor. Unlike previous seasons of The Challenge, there were no predetermined teams. Instead, the cast members had to forge their own alliances. Of the twenty cast members, there were only four winners. The Island premiered on September 10, 2008, and concluded on October 29, 2008.","poster_path":null,"season_number":16},{"air_date":"2009-04-08","episode_count":10,"id":117,"name":"The Duel II","overview":"The Duel II is the 17th season of the MTV reality game show, The Challenge. The season is directly subsequent to The Island. The Duel II is the sequel to the show's 13th season, The Duel, and succeeds The Island season. It took place in Queenstown, New Zealand, with former cast members from MTV's The Real World and Road Rules competing along with several cast members from the Fresh Meat challenge. The cast departed for Queenstown, New Zealand on October 27, 2008 and filming ran through early December. This season premiered on Wednesday, April 8, 2009 and concluded on June 17, 2009 with the reunion show.","poster_path":null,"season_number":17},{"air_date":"2009-09-30","episode_count":12,"id":122,"name":"The Ruins","overview":"Real World Road Rules Challenge: The Ruins is the eighteenth season of the MTV reality television game show, Real World/Road Rules Challenge, and follows The Duel II. The Ruins took place in Phuket, Thailand, with former cast members from MTV's The Real World and Road Rules competing along with several cast members from the Fresh Meat challenge. This season was played in the format of two teams: Champions and Challengers. Players on the Champions team had won at least one previous challenge, while players on the Challengers team had never won a challenge.\n\nThis is the last season to use Real World/Road Rules in the on-screen title, before being shortened to The Challenge in the 19th season.\n\nThe season premiered on September 30, 2009 and concluded with the \"S#!t They Should Have Shown\" special on December 23, 2009.","poster_path":null,"season_number":18},{"air_date":"2010-04-07","episode_count":11,"id":130,"name":"Fresh Meat II","overview":"","poster_path":null,"season_number":19},{"air_date":"2010-10-06","episode_count":11,"id":131,"name":"Cutthroat","overview":"The Challenge: Cutthroat is the 20th season of the MTV reality game show, The Challenge.\n\nFilmed in Prague, Czech Republic, Cutthroat features a first-ever three-team format with cast members from The Real World, Road Rules, and The Challenge. The season premiered on Wednesday, October 6, 2010","poster_path":null,"season_number":20},{"air_date":"2011-06-22","episode_count":12,"id":139,"name":"Rivals","overview":"The Challenge: Rivals is the 21st season of the MTV reality game show, The Challenge. Rivals takes place in Costa Rica, Argentina, and Patagonia. The season used former cast members from The Real World and The Challenge.\n\nRivals marked the first season of The Challenge to not include any cast members from cancelled series Road Rules. The season featured an incendiary format in which players were teamed with their arch enemies from past seasons of The Real World and The Challenge. The season premiered on June 22, 2011","poster_path":null,"season_number":21},{"air_date":"2012-01-25","episode_count":13,"id":121,"name":"Battle of the Exes","overview":"The Challenge: Battle of the Exes is the 22nd season of the MTV reality game show, The Challenge. It takes place in the Dominican Republic and Iceland, with former cast members from MTV's The Real World, Road Rules, and The Challenge competing.  The season premiered on January 25, 2012, and concluded on April 4, 2012, with the Reunion special.","poster_path":null,"season_number":22},{"air_date":"2012-09-19","episode_count":12,"id":133,"name":"Battle of the Seasons","overview":"The Challenge: Battle of the Seasons is the 23rd season of the MTV reality game show, The Challenge. Although sharing the same name as the show's 5th season, Battle of the Seasons, unlike other sequel seasons is not distinguished as part \"II\" as the Season has a completely different format as well as different rules. The season took place in Bodrum, Turkey and Swakopmund, Namibia.","poster_path":null,"season_number":23},{"air_date":"2013-07-10","episode_count":13,"id":144,"name":"Rivals 2","overview":"The Challenge: Rivals II is the 24th season of the MTV reality game show, The Challenge. The season take places in Phuket, Thailand, with former cast members from MTV's The Real World and The Challenge competing. The season followed the same format as the original Rivals challenge, with players paired up with arch enemies from past seasons of The Real World and The Challenge.","poster_path":null,"season_number":24},{"air_date":"2014-04-10","episode_count":13,"id":64112,"name":"Free Agents","overview":"The Challenge: Free Agents is the 25th season of the MTV reality game show, The Challenge. The season is located in Uruguay and Chile, with former cast members from MTV's The Real World and The Challenge competing. This season marks the first since season 12 that does not include any cast members from The Real World: Austin or the first Fresh Meat challenge. The season follows a new format, featuring each contestant competing in either teams, pairs or for themselves, for a share of $350,000 in prize money.","poster_path":null,"season_number":25},{"air_date":"2015-01-06","episode_count":14,"id":63977,"name":"Battle of the Exes II","overview":"The Challenge: Battle of the Exes II is the 26th season of MTV's reality game show, The Challenge, and the sequel to the show's 22nd season, Battle of the Exes. Filming occurred in Pedasí, Panama and Ørsta, Norway in August and September 2014, with former cast members from MTV's The Real World, The Challenge, and Are You the One? competing","poster_path":null,"season_number":26},{"air_date":"2015-12-02","episode_count":15,"id":71909,"name":"Battle of the Bloodlines","overview":"​​​This season just got VERY personal. We've seen rivals, exes, veterans, rookies, and even free agents earn their victories on The Challenge. Now, fourteen players from MTV series will travel to Bodrum, Turkey to join the people who know their toughest strengths, crippling weaknesses, and deepest fears better than anyone -- their own flesh and blood. In this unprecedented format, competitors will battle it out WITH and AGAINST their bloodlines, turning family into foe. This shake-up gets even more twisted when players learn that their fates are combined with their bloodlines'. It's anyone's game when family still means everything, because despite strong performances, competitors could still go home if their relatives fall short. With $350,000 on the line and family honor to defend, there will be blood. ","poster_path":null,"season_number":27},{"air_date":"2016-05-04","episode_count":17,"id":76843,"name":"Rivals III","overview":"They’ve been pissed off. They’ve been wronged. They’ve been betrayed. And now they want vengeance! Rivals is back and the stakes couldn’t be higher! Twenty-six fan-favorites from The Challenge, The Real World, and Are You The One will head to exotic Mexico and be paired up with their biggest enemy! However...this time around the game has a shocking twist – players will be paired up with their rival – of the opposite sex! These guys and girls must figure out a way get over their bad blood as they compete in a series of heart-pounding challenges in order to earn a share of the massive $350,000 prize! Tempers will rise, passions will flare, and pride will be on the line in the most shocking season of The Challenge yet!","poster_path":"/q2gUXets0Hyd96dBDo4j3kwgVAU.jpg","season_number":28},{"air_date":"2017-02-07","episode_count":16,"id":84623,"name":"Invasion of the Champions","overview":"In Season 29, Invasion of the Champions, 18 Underdogs battle across a series of contests for the chance to move out of squalor and into typical Challenge luxury, The Oasis! Just when the lucky ones get comfortable, they’ll find the game is far from over. The final crop of Underdogs will have to face down eight proven Champions for their share at the $350,000 prize. With devastating elimination rounds, truly baffling hookups and the first-ever three-day final on the way, Season 29 may just prove to be the most unpredictable and gripping yet!","poster_path":"/ma306jwGwuot5VelL6Gi6KrKKaG.jpg","season_number":29},{"air_date":"2017-07-18","episode_count":20,"id":88424,"name":"XXX: Dirty Thirty","overview":"To celebrate the 30th season of The Challenge, MTV is bringing back the dirtiest and most unpredictable players in The Challenge history for the biggest prize ever - $1 MILLION DOLLARS! This devious bunch will stop at nothing to win the game and compete against each other on The Challenge XXX: Dirty 30. Fifteen men and fifteen women will have to fight their way through some of the craziest, most daring challenges yet. And with this devious assortment of players, the backstabbing and masterminding will be just as intense off the field as on the field. Trust. No. One.","poster_path":"/mm1Y68KF2XlbQOdI82qnibFct0O.jpg","season_number":30},{"air_date":"2018-01-02","episode_count":16,"id":97708,"name":"Vendettas","overview":"Twenty-eight players including stars from MTV UK’s Ex on the Beach and Geordie Shore along with contestants from Big Brother join The Challenge fan favorites as they travel to Spain to pursue their personal vendettas against one another. And this season, for the very first time, every player is out solely for themselves not their team.","poster_path":"/vtTKNYW9zGIEhlEp2LEqyYIMs9z.jpg","season_number":31},{"air_date":"2018-07-10","episode_count":24,"id":106189,"name":"Final Reckoning","overview":"The thirty-second season features alumni from Real World, Road Rules, The Challenge, Are You the One?, the U.S. version of Big Brother, and the U.K. television shows Ex on the Beach and Geordie Shore, competing along with, for the first time, alumni from Bad Girls Club and Vanderpump Rules who appeared on the U.S. version of Ex on the Beach.","poster_path":null,"season_number":32},{"air_date":"2019-02-06","episode_count":18,"id":118438,"name":"War of the Worlds","overview":"In season 33, War of the Worlds, America's best will be taking on competitors from around the globe. Legendary Challenge Veterans will team up with Rookies from “The Bachelor,” “Big Brother” and other reality shows to compete for $1 million in the most grueling, physical and mental challenges ever devised. Who will survive?","poster_path":"/rjkRR0vJU7iSv8dEwhDzhPjxko5.jpg","season_number":33},{"air_date":"2019-08-28","episode_count":18,"id":131090,"name":"War of the Worlds 2","overview":"Set in the middle of the jungle, “The Challenge: War of the Worlds 2” returns to a classic team format; 14 Brits will battle it out against 14 Americans for their share of the $1 million-dollar prize.","poster_path":"/yjmS3BqT9CNNEv8ayGJFDdpclwL.jpg","season_number":34},{"air_date":"2020-04-01","episode_count":16,"id":144551,"name":"Total Madness","overview":"","poster_path":"/vmoLHBmaqraxI8DG24tj5mLJTBx.jpg","season_number":35}],"status":"Returning Series","type":"Reality","vote_average":7.9,"vote_count":35}