{"backdrop_path":null,"created_by":[{"id":1212416,"credit_id":"5253334e19c2957940025d79","name":"Jay Bernstein","profile_path":null},{"id":56191,"credit_id":"5590ac5b9251416489002f3b","name":"Michael Butler","profile_path":null}],"episode_run_time":[45,60],"first_air_date":"1987-03-11","genres":[{"id":18,"name":"Drama"},{"id":80,"name":"Crime"}],"homepage":"","id":51,"in_production":false,"languages":["en"],"last_air_date":"1988-06-07","last_episode_to_air":{"air_date":"1988-06-07","episode_number":22,"id":1397,"name":"The Jungle Fighter","overview":"The Vietnamese community is up in arms when three of their immigrants are murdered. All clues point to a Vietnam veteran with a history of violence. Neither the tight-knit community nor the vets are interested to cooperate with the police. When the Knights go to talk with this veteran, Joe and the man end up in a stand-off, each man aiming a gun at the other. A nurse who served with the man, helps to talk him down. Later as the Knights talk with the nurse and others, they discover the doctor who has been counseling these veterans has been interested in every aspect of killing someone. The veterans say the doctor is more violent then they are. The doctor goes to pick up the nurse because he thinks she is attracted to him but when she refuses him, he threatens to kill her. Joey kicks in her door and kills the man.","production_code":"","season_number":2,"show_id":51,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Houston Knights","next_episode_to_air":null,"networks":[{"name":"CBS","id":16,"logo_path":"/nm8d7P7MJNiBLdgIzUK0gkuEA4r.png","origin_country":"US"}],"number_of_episodes":31,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Houston Knights","overview":"Houston Knights is an American crime drama set in Houston, Texas. The show ran on CBS from 1987 to 1988 and had 31 episodes. The core of the show was the partnership between two very different cops from two different cultures. Chicago cop Joey LaFiamma, played by Michael Paré, is transferred to Houston after he kills a mobster from a powerful Mafia family and a contract is put out on him. Once there, he is partnered with Levon Lundy, played by Michael Beck, the grandson of a Texas Ranger.\n\nAlthough as different as night and day, and after a rocky beginning they form a successful partnership and become friends. This is aided to a certain extent by an event where a hitman from Chicago who holds the contract to shoot La Fiamma arrives in Houston and is ultimately killed by Lundy.\n\nDuring the series, it is revealed that both La Fiamma and Lundy have their own personal demons; La Fiamma's Chicago police partner had been killed when he went ahead while La Fiamma had waited for backup to arrive. Lundy's wife had been killed by an explosion that was intended to kill him.","popularity":4.004,"poster_path":null,"production_companies":[{"id":3614,"logo_path":"/qFRpYYtU9iyVKDMpm3a8tN7Q7YE.png","name":"Columbia Pictures Television","origin_country":"US"}],"seasons":[{"air_date":"1987-03-11","episode_count":9,"id":85,"name":"Season 1","overview":"","poster_path":"/fjsOVa32V001vqwvaEDaHw53Hdx.jpg","season_number":1},{"air_date":"1987-09-15","episode_count":22,"id":86,"name":"Season 2","overview":"","poster_path":"/rFVthxBra88VPpRqGy11zgKTmWb.jpg","season_number":2}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}