{"backdrop_path":"/p62osAAoVW6IwMPlGXxpQnQdBNx.jpg","created_by":[{"id":57293,"credit_id":"52533b6119c295794006dbc2","name":"Sydney Newman","gender":2,"profile_path":"/rHiq1YfDPXCfkig7CwUiSGSs4N2.jpg"},{"id":70978,"credit_id":"58cf45e89251415a8b02cb65","name":"Verity Lambert","gender":1,"profile_path":null},{"id":1213433,"credit_id":"52533b6219c295794006dbca","name":"Donald Wilson","gender":2,"profile_path":null},{"id":1213434,"credit_id":"52533b6319c295794006dbd2","name":"C. E. Webber","gender":2,"profile_path":"/lHzDADWGW2ESV1uDovZzLG79sRc.jpg"}],"episode_run_time":[25],"first_air_date":"1963-11-23","genres":[{"id":10759,"name":"Action & Adventure"},{"id":18,"name":"Drama"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"http://www.bbc.co.uk/doctorwho/","id":121,"in_production":false,"languages":["en"],"last_air_date":"1989-12-06","last_episode_to_air":{"air_date":"1989-12-06","episode_number":14,"id":168806,"name":"Survival, Part Three","overview":"Ace manages to transport the Doctor and the others back to Perivale but the Master is also there, preparing for a final showdown with the Doctor.","production_code":"","season_number":26,"show_id":121,"still_path":"/hrog2XVbc5JhS1f9BRBGwIassXc.jpg","vote_average":5.0,"vote_count":1},"name":"Doctor Who","next_episode_to_air":null,"networks":[{"name":"BBC One","id":4,"logo_path":"/mVn7xESaTNmjBUyUtGNvDQd3CT1.png","origin_country":"GB"}],"number_of_episodes":702,"number_of_seasons":26,"origin_country":["GB"],"original_language":"en","original_name":"Doctor Who","overview":"The adventures of a Time Lord—a time-travelling humanoid alien known as the Doctor—who explores the universe in his TARDIS, a sentient time-travelling space ship. Its exterior appears as a blue British police box, which was a common sight in Britain in 1963 when the series first aired. Along with a succession of companions, the Doctor faces a variety of foes while working to save civilisations, help ordinary people, and right wrongs.","popularity":67.993,"poster_path":"/qgtHj2YyIMwGCCq2QQfWUvkqAUx.jpg","production_companies":[{"id":3324,"logo_path":"/16fY7pucCzn7WSOYxOGRHlAayL3.png","name":"BBC","origin_country":"GB"}],"seasons":[{"air_date":"2009-11-15","episode_count":136,"id":6968,"name":"Specials","overview":"","poster_path":"/itgDlYFYw03RTTcB8RHCfplxCaq.jpg","season_number":0},{"air_date":"1963-11-23","episode_count":42,"id":6969,"name":"Season 1","overview":"The first season of British science fiction television series Doctor Who began on 23 November 1963 with the first ever story An Unearthly Child and ended on 12 September 1964 with The Reign of Terror.","poster_path":"/txE3n9pprkUzTX9F1IECLHGefq6.jpg","season_number":1},{"air_date":"1964-10-31","episode_count":39,"id":6970,"name":"Season 2","overview":"The second season of British science fiction television series Doctor Who began on 31 October 1964 with the story Planet of Giants and ended on 24 July 1965 with The Time Meddler.","poster_path":"/25OIBNDsW7z2YvkoGyaaiZ5yUCk.jpg","season_number":2},{"air_date":"1965-09-11","episode_count":45,"id":6971,"name":"Season 3","overview":"The third season of British science fiction television series Doctor Who began on 11 September 1965 with the story Galaxy 4 and ended on 16 July 1966 with The War Machines.","poster_path":"/7Flj7DY5cDkdQEvWyWwhmWTmGtL.jpg","season_number":3},{"air_date":"1966-09-10","episode_count":43,"id":6972,"name":"Season 4","overview":"The fourth season of British science fiction television series Doctor Who began on 10 September 1966 with the 1st Doctor story The Smugglers and, after a change of lead actor part-way through the series, ended on 1 July 1967 with The Evil of the Daleks. For the first time, the entire main cast changed over the course of a single season.","poster_path":"/3F5HTvT2et5Xo9SsIM6lBCGLEQ.jpg","season_number":4},{"air_date":"1967-09-02","episode_count":40,"id":6973,"name":"Season 5","overview":"The fifth season of British science fiction television series Doctor Who began on 2 September 1967 with the first story of season 5 The Tomb of the Cybermen and ended on 1 June 1968 with The Wheel in Space.","poster_path":"/cx9oAvfbmhimEc52ZkeFje17Aoh.jpg","season_number":5},{"air_date":"1968-08-10","episode_count":44,"id":6974,"name":"Season 6","overview":"The sixth season of British science fiction television series Doctor Who began on 10 August 1968 with the first story of season 6 The Dominators and ended Patrick Troughton's reign as the Doctor with its final story The War Games.","poster_path":"/7v9bMTlI8WdBaCRhh1FUPUZLu7q.jpg","season_number":6},{"air_date":"1970-01-02","episode_count":25,"id":6975,"name":"Season 7","overview":"The seventh season of British science fiction television series Doctor Who began on 3 January 1970 with Jon Pertwee's first story Spearhead from Space and ended with Inferno.","poster_path":"/viP64YaPlDAiqLKY2GZIJ4vTWcw.jpg","season_number":7},{"air_date":"1971-01-01","episode_count":25,"id":6976,"name":"Season 8","overview":"The eighth season of British science fiction television series Doctor Who began on 2 January 1971 with Terror of the Autons and ended with The Dæmons featuring Jon Pertwee as the Third Doctor.","poster_path":"/kizuLfenibc5LUrBhaxL1U4cCl5.jpg","season_number":8},{"air_date":"1972-01-01","episode_count":26,"id":6977,"name":"Season 9","overview":"The ninth season of British science fiction television series Doctor Who began on 1 January 1972 with Day of the Daleks, and ended with The Time Monster.","poster_path":"/6fnWKtuHqoA6OIKeiI10XX4JF3.jpg","season_number":9},{"air_date":"1972-12-30","episode_count":26,"id":6978,"name":"Season 10","overview":"The tenth season of British science fiction television series Doctor Who began on 30 December 1972 with the 10th anniversary special The Three Doctors, and ended with Katy Manning's final serial The Green Death.","poster_path":"/mwT2vfFbirN4bkKSFDEF9rzXqEy.jpg","season_number":10},{"air_date":"1973-12-15","episode_count":26,"id":6979,"name":"Season 11","overview":"The eleventh season of British science fiction television series Doctor Who began on 15 December 1973 with the serial The Time Warrior, and ended with Jon Pertwee's final serial Planet of the Spiders.","poster_path":"/yjm1PbzOhBcnmwy7SB1HJ2ec9I0.jpg","season_number":11},{"air_date":"1974-12-28","episode_count":20,"id":6980,"name":"Season 12","overview":"The twelfth season of British science fiction television series Doctor Who began on 28 December 1974 with Tom Baker's first serial Robot and ended with Revenge of the Cybermen on 10 May 1975.\n\nThis is the first season to feature Tom Baker as the fourth incarnation of the Doctor, an alien Time Lord who travels through time and space in his TARDIS, which appears to be a British police box on the outside. He is accompanied by companions Sarah Jane Smith, continuing from season eleven, and Harry Sullivan, who joins in this season.","poster_path":"/q5yjVns0Qrp3jkgJeAx61p91Kjm.jpg","season_number":12},{"air_date":"1975-08-30","episode_count":26,"id":6981,"name":"Season 13","overview":"The thirteenth season of British science fiction television series Doctor Who began on 30 August 1975 with the story Terror of the Zygons and ended with The Seeds of Doom.","poster_path":"/n7Z7ehprCb9stmfQ9GPyedcfQ1O.jpg","season_number":13},{"air_date":"1976-09-04","episode_count":26,"id":6982,"name":"Season 14","overview":"The fourteenth season of British science fiction television series Doctor Who began on 4 September 1976 with The Masque of Mandragora and ended with The Talons of Weng-Chiang.","poster_path":"/wqPg5N7U2L637ogn5Xjd8cW3czt.jpg","season_number":14},{"air_date":"1977-09-03","episode_count":26,"id":6983,"name":"Season 15","overview":"K-9 is introduced, Rutans invade Earth and Sontarans storm Gallifrey!","poster_path":"/4W3RL8EnFmuUA4ovIu21puqrVL7.jpg","season_number":15},{"air_date":"1978-09-01","episode_count":26,"id":6984,"name":"Season 16","overview":"The sixteenth season of British science fiction television series Doctor Who began in 1 September 1978 with the episode The Ribos Operation and ended with The Armageddon Factor.","poster_path":"/jhVl0fM8N5kNP2XojAzhnPbCum1.jpg","season_number":16},{"air_date":"1979-09-01","episode_count":26,"id":6985,"name":"Season 17","overview":"The seventeenth season of British science fiction television series Doctor Who began on 1 September 1979 with the story Destiny of the Daleks and ended with Horns of Nimon -- although the usual season 6-episode closing story, Shada, was not televised.","poster_path":"/grNR3ujLkMWSulXJLg3b7qjuFH6.jpg","season_number":17},{"air_date":"1980-08-30","episode_count":28,"id":6986,"name":"Season 18","overview":"The eighteenth season of British science fiction television series Doctor Who began on 30 August 1980 with the serial The Leisure Hive and ended with Tom Baker's swan song Logopolis.","poster_path":"/3Az1mJajXBPlgpNAwb47xQnq5ms.jpg","season_number":18},{"air_date":"1982-01-04","episode_count":26,"id":6987,"name":"Season 19","overview":"The nineteenth season of British science fiction television series Doctor Who began on 4 January 1982 with Castrovalva, and ended with Time-Flight.","poster_path":"/6VKGkAEItVApuVA3YlO53PYEuhw.jpg","season_number":19},{"air_date":"1983-01-03","episode_count":22,"id":6988,"name":"Season 20","overview":"The twentieth season of British science fiction television series Doctor Who began on 3 January 1983 with the story Arc of Infinity, and ended 16 March 1983 with The King's Demons. A 20th Anniversary special, The Five Doctors, followed in November 1983.","poster_path":"/ebtEqg5eyZFBd446xERZPeOsPgg.jpg","season_number":20},{"air_date":"1984-01-05","episode_count":26,"id":6989,"name":"Season 21","overview":"The twenty-first season of British science fiction television series Doctor Who began on 5 January 1984 with the 5th Doctor serial Warriors of the Deep, and ended with Colin Baker's first serial The Twin Dilemma. For only the second time, the entire TARDIS crew changed over the course of a single season.","poster_path":"/22AydUd2eM0QWMrxPPY8JlKd1cz.jpg","season_number":21},{"air_date":"1985-01-05","episode_count":13,"id":6990,"name":"Season 22","overview":"The twenty-second season of British science fiction television series Doctor Who began on 5 January 1985 with the serial Attack of the Cybermen, and ended with Revelation of the Daleks.","poster_path":"/x3A3q3W4TxFu1PePEP9y0yNEqsp.jpg","season_number":22},{"air_date":"1986-09-06","episode_count":14,"id":6994,"name":"Season 23","overview":"The Trial of a Time Lord is a 14-part British science fiction serial of the long-running BBC series Doctor Who. The serial, produced as the twenty-third season of the Doctor Who television series, aired in weekly episodes from 6 September to 6 December 1986. The only Doctor Who presentation of its kind, it contains four mini-adventures, The Mysterious Planet, Mindwarp, Terror of the Vervoids and ended with Colin Baker's final story The Ultimate Foe.\n\nThe idea for the serial stemmed from several production changes to Doctor Who, such as reduced screen time for the season and a request from BBC controller Michael Grade that the series contain less violence and more humour. Several problems occurred during production, including the death of scriptwriter Robert Holmes, and the resignation of script editor Eric Saward.","poster_path":"/qDY6BnXfGsnw66dUqOVUJTlKXiu.jpg","season_number":23},{"air_date":"1987-09-07","episode_count":14,"id":6991,"name":"Season 24","overview":"The twenty-fourth season of British science fiction television series Doctor Who began on 7 September 1987 with Sylvester McCoy's first story Time and the Rani, and ended with Dragonfire.","poster_path":"/t4SwXEWJ7fCb6l6ZqdyfDsZCRil.jpg","season_number":24},{"air_date":"1988-10-05","episode_count":14,"id":6992,"name":"Season 25","overview":"The twenty-fifth season of British science fiction television series Doctor Who began on 5 October 1988 with the serial Remembrance of the Daleks, and ended with The Greatest Show in the Galaxy.","poster_path":"/x8ALIgbMTw4KTDvh3yqpJsr65wB.jpg","season_number":25},{"air_date":"1989-09-06","episode_count":14,"id":6993,"name":"Season 26","overview":"The twenty-sixth season of British science fiction television series Doctor Who began on 9 September 1989 with the serial Battlefield, after a regular series of four serials was broadcast finishing with Survival which was the final episode of Doctor Who to air before a 16-year absence from episodic television following its cancellation.","poster_path":"/i9hQAG0lxa6xLM442ofKTg7lyM9.jpg","season_number":26}],"status":"Ended","type":"Scripted","vote_average":7.9,"vote_count":258}