{"backdrop_path":null,"created_by":[{"id":1211959,"credit_id":"52532fc819c2957940007dd4","name":"Jeff Eastin","gender":2,"profile_path":null}],"episode_run_time":[60],"first_air_date":"2004-09-01","genres":[{"id":18,"name":"Drama"}],"homepage":"","id":26,"in_production":false,"languages":["en"],"last_air_date":"2004-10-06","last_episode_to_air":{"air_date":"2004-10-06","episode_number":7,"id":89,"name":"Out of Time","overview":"A Hawaiian family feud ends up in murder. So the dectectives are on it. And when they research on it, they go back 200 years of family history.","production_code":"","season_number":1,"show_id":26,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Hawaii","next_episode_to_air":null,"networks":[{"name":"NBC","id":6,"logo_path":"/o3OedEP0f9mfZr33jz2BfXOUK5.png","origin_country":"US"}],"number_of_episodes":8,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Hawaii","overview":"Hawaii is a United States television series produced and distributed by NBC Universal Television for the NBC television network. Originally titled Pearl City, this police drama was produced with the series Hawaii Five-O in mind, and debuted on August 31, 2004. Written by Executive Producer Jeff Eastin, the series revolves around a fictional elite crime unit of the Honolulu Police Department headed by veteran detective and local legend Sean Harrison and John Declan, a former Chicago Police Department detective transferred to the state of Hawaii for his talents.\n\nThe series was written by Jeff Eastin, Chris Black, Reid Steiner, Wendy West, Eric Haywood, and Travis Romero.\n\nThe series is considered one of the most ambitious projects in the history of the Hawaii State Department of Business, Economic Development and Tourism's Hawaii Film Office, desperate to repeat the economic prosperity once gained and driven by the CBS television series such as Hawaii Five-O and Magnum, P.I. for the state's tourism industry.\n\nThe series was canceled in October 2004. Although eight episodes were filmed, only seven actually aired.","popularity":2.702,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2004-09-01","episode_count":8,"id":5,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":9.5,"vote_count":1}