{"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"2006-05-11","genres":[],"homepage":"http://www.bbc.co.uk/bbcfour/features/fullstops/","id":361,"in_production":true,"languages":["en"],"last_air_date":"2006-09-27","last_episode_to_air":{"air_date":"2006-09-27","episode_number":3,"id":18587,"name":"Series 1, Show 3","overview":"","production_code":"","season_number":1,"show_id":361,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Never Mind the Full Stops","next_episode_to_air":null,"networks":[{"name":"BBC Four","id":100,"logo_path":"/lYk9QLeOO9RFuDz8pnW8NcoEL8B.png","origin_country":"GB"}],"number_of_episodes":3,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Never Mind the Full Stops","overview":"Never Mind the Full Stops is a British television panel game based on the English language, its idiosyncrasies, and its misuse. It is hosted by the British actor, author and Oscar-winning screenwriter, Julian Fellowes. Each episode lasts 30 minutes. The series was filmed in March 2006 at Channel 4's studios in Horseferry Road, Westminster. It was originally broadcast on BBC Four, and aired on BBC Two from 9 October 2006.\n\nTwo teams of two people are faced with various questions and challenges concerning English grammar, spelling and usage. The show is divided into rounds, with themes such as identifying the famous author of a badly spoken sentence and correcting the punctuation in a written sentence. There is also a quick-fire round with questions such as \"What is a malapropism?\" Points are awarded throughout the show to determine the winning team.\n\nEach show starts with the host giving a 'difficult-to-spell' word and an example mnemonic to help remember that spelling, and by the end of the show the panellists have to have devised their own. In episode one Julian Fellowes gave the example arithmetic: A Rat In The House Might Eat The Ice Cream; and Ned Sherrin's version was: As Richard Interred The Head Master Every Tiny Infant Cheered. By the end of series 1, even Julian Fellowes had realized that these so-called mnemonics were invariably harder to remember than the spellings – particularly as they were rarely related to the words in question.","popularity":0.627,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2006-09-13","episode_count":3,"id":1061,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":8.0,"vote_count":1}