{"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":null,"genres":[],"homepage":"","id":258,"in_production":true,"languages":[],"last_air_date":null,"last_episode_to_air":null,"name":"ESPNU Coaches Spotlight","next_episode_to_air":null,"networks":[{"name":"ESPNU","id":81,"logo_path":"/oByKzXnqvTqCD9ctG0sFMm5Mn4E.png","origin_country":"US"}],"number_of_episodes":0,"number_of_seasons":0,"origin_country":["US"],"original_language":"en","original_name":"ESPNU Coaches Spotlight","overview":"ESPNU College Coaches Spotlight is a television program that showcases live college football coaches press conferences from around the country. The program airs every Tuesday for three hours from 12pm ET to 4pm ET on ESPNU during the college football season. Since debuting on September 12, 2006, the host was ESPNU signature anchor Mike Hall along with analysis from ESPN's Scout's Inc. analysts Tom Luginbill and Todd McShay. Luginbill also appears on ESPNU Recruiting Insider, McShay also appears on ESPNU Inside the Polls and Hall appears on both as host.\n\nAlso starring on the show is Jim Donnan, who was the Offensive Coordinator at the University of Oklahoma from 1985-1989. From 1985-1988, he coached under Barry Switzer, a member of the College Football Hall of Fame and Super Bowl winning coach. Donnan coached the legendary Oklahoma Sooner Wishbone Offense, a formation that was perfected by Switzer in 1971 when it shattered the NCAA record for total offense per game and eventually led the Sooners to national championships in 1974 and 1975. Under Donnan, the Wishbone helped the Sooners to impressive 11-1 seasons from 1985–1987, including a national championship in 1985. In 1986, the Sooners scored 508 points, which at the time was the second highest point total in school history, trailing only the 1971 NCAA record setting offense.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}