{"backdrop_path":"/wkR77Rlb4RGPJJaIouVSYRjM4a5.jpg","created_by":[{"id":1215124,"credit_id":"52534afc19c29579400f4cb0","name":"Steve Cuden","profile_path":null}],"episode_run_time":[30],"first_air_date":"1999-11-20","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"}],"homepage":"","id":281,"in_production":false,"languages":["en"],"last_air_date":"2001-03-24","last_episode_to_air":{"air_date":"2001-03-24","episode_number":13,"id":14901,"name":"Last Chance","overview":"Worth Dwindling reappears to lure Stunts into a meeting with Rexton, who promises funding for the medical research Carlos' father needs if Stunts helps Rexcor win the final race of the season and by so doing, the Unlimited Series Championship.  His back to the wall financially, Carlos agrees, and permits The Collector to take the pole in their joint time trial.  Megan, who is again driving for Team Fastex, announces that Spitfire Racers will be disbanded after the race, but Zorina might as well already be back in a Rexcor uniform, for her true colors are apparent come raceday.  She and Junker wreck Charger, who is badly shaken up by the crash and cannot continue even though Spitfire pushes his damaged machine onto his IMP.  Seeing the stricken son of his former racing friend shames Farrell Longstreet into revealing the phony nature of his own race injuries, leading him to take over as relief driver for Charger.  Enraged over Longstreet's betrayal, Rexton orders Specter and The Collecto","production_code":"","season_number":2,"show_id":281,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"NASCAR Racers","next_episode_to_air":null,"networks":[{"name":"FOX","id":19,"logo_path":"/1DSpHrWyOORkL9N2QHX7Adt31mQ.png","origin_country":"US"}],"number_of_episodes":24,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"NASCAR Racers","overview":"NASCAR Racers is an animated television series about two rival NASCAR racing teams, Team Fastex and Team Rexcor, competing against each other in the futuristic NASCAR Unlimited Division.\n\n26 half-hour episodes were produced by Saban, and shown on the Fox network between 1999-2001.\n\nSeveral NASCAR Racers books, one Game Boy, and one PC video game were adapted from the show. NASCAR Racers books were authored by Gene Hult under the name J. E. Bright, and published by HarperEntertainment. The show was produced before Fox showed NASCAR races, and the show's broadcast history only overlapped with the network's coverage of the real series for one month.","popularity":2.24,"poster_path":"/xi3XaKx0v4gpaQcWp6Rf0yA20wm.jpg","production_companies":[],"seasons":[{"air_date":"2000-02-05","episode_count":11,"id":879,"name":"Season 1","overview":"","poster_path":null,"season_number":1},{"air_date":"2000-10-28","episode_count":13,"id":880,"name":"Season 2","overview":"","poster_path":null,"season_number":2}],"status":"Ended","type":"Scripted","vote_average":7.4,"vote_count":5}