{"backdrop_path":"/Lkw5pP0qg6iJGUjFObnpqSgUKV.jpg","created_by":[{"id":29715,"credit_id":"5253567c19c2957940146e4f","name":"David Swift","gender":0,"profile_path":"/pJj8kzfOriano9MziBDLaWuGjZB.jpg"}],"episode_run_time":[20,30],"first_air_date":"1970-09-19","genres":[{"id":35,"name":"Comedy"}],"homepage":"","id":428,"in_production":false,"languages":["en"],"last_air_date":"1972-03-06","last_episode_to_air":{"air_date":"1972-03-06","episode_number":24,"id":21843,"name":"Star Trekking","overview":"A story about Arnie's frustrating attempt to get the comic for an awards ceremony.","production_code":"","season_number":2,"show_id":428,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Arnie","next_episode_to_air":null,"networks":[{"name":"CBS","id":16,"logo_path":"/nm8d7P7MJNiBLdgIzUK0gkuEA4r.png","origin_country":"US"}],"number_of_episodes":48,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Arnie","overview":"Arnie is a television sitcom that ran for two seasons on the CBS network. It stars Herschel Bernardi, Sue Ane Langdon, and Roger Bowen.\n\nBernardi played the title character, Arnie Nuvo, a longtime blue collar employee at the fictitious Continental Flange Company, who overnight was promoted to an executive position. The storylines mainly focused on this fish out of water situation, and on Arnie's sometimes-problematic relationship with his well-meaning but wealthy and eccentric boss, Hamilton Majors Jr.. Because he still held his union card, Arnie could negotiate tricky management/labor situations that no one else could. Arnie's surname was presumably a pun on nouveau riche, and possibly also on Art Nouveau.\n\nIn addition to Bernardi, Bowen, and Langdon, cast members included Del Russel and Stephanie Steele as Arnie's son and daughter, Richard and Andrea; Elaine Shore as Arnie's secretary, Felicia; and Herb Voland as sour-tempered executive Neil Ogilvie.\n\nIn its first season, despite being the lead-in to The Mary Tyler Moore Show on Saturday nights and winning an Emmy nomination as best comedy series, Arnie received only fair Nielsen ratings. For its second season, in order to increase its viewership, CBS made a major cast change in the show's format. Charles Nelson Reilly joined the cast as Randy Robinson, a TV chef who called himself \"The Giddyap Gourmet,\" apparently a reference to The Galloping Gourmet.","popularity":4.133,"poster_path":"/1zecxYJyYAgM03w6skRb1p7SOHo.jpg","production_companies":[],"seasons":[{"air_date":"1970-09-19","episode_count":24,"id":1254,"name":"Season 1","overview":"","poster_path":null,"season_number":1},{"air_date":"1971-09-13","episode_count":24,"id":1253,"name":"Season 2","overview":"","poster_path":null,"season_number":2}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}