{"backdrop_path":null,"created_by":[],"episode_run_time":[30,28],"first_air_date":"2000-02-04","genres":[{"id":35,"name":"Comedy"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"http://www.myhero.org.uk/","id":354,"in_production":false,"languages":["en"],"last_air_date":"2006-09-10","last_episode_to_air":{"air_date":"2006-09-10","episode_number":8,"id":18256,"name":"Believe","overview":"When George's super-powers begin to malfunction, Thermoman begins to destroy more than he saves. Arnie must perform an MOT to George's self-confidence that have unexpected consequences.","production_code":"","season_number":6,"show_id":354,"still_path":"/AruOXMvwkUmjbUKYQsik27DNUxn.jpg","vote_average":0.0,"vote_count":0},"name":"My Hero","next_episode_to_air":null,"networks":[{"name":"BBC One","id":4,"logo_path":"/mVn7xESaTNmjBUyUtGNvDQd3CT1.png","origin_country":"GB"}],"number_of_episodes":50,"number_of_seasons":6,"origin_country":["GB"],"original_language":"en","original_name":"My Hero","overview":"My Hero is a BBC sitcom created by Paul Mendelson. The programme ran for six series, first broadcast in February 2000, and concluding in September 2006. The series follows the antics of the dim-witted superhero \"Thermoman\", portrayed by Ardal O'Hanlon in series one to five and by James Dreyfus in the final series. The series was regularly directed by John Stroud. In the UK, the digital channel Gold regularly re-runs the programme, although the last series has yet to appear on the channel. In the United States it was shown on PBS and, briefly, BBC America. In Australia, UKTV offered re-runs of the first three series, while BBC Entertainment provided repeats for Scandinavia.","popularity":1.89,"poster_path":"/doBrGBKpKB1xVnZWMIFej1YBGie.jpg","production_companies":[],"seasons":[{"air_date":"2000-12-22","episode_count":5,"id":1031,"name":"Specials","overview":"","poster_path":null,"season_number":0},{"air_date":"2000-02-04","episode_count":6,"id":1029,"name":"Season 1","overview":"The first series of British television comedy My Hero ran from February 4, 2000, to December 22, 2000. The series featured seven episodes, and introduced the main cast of George Sunday, Janet Dawkins, Piers Crispin, Tyler, Mrs. Raven, Arnie, Ella Dawkins, Stanley Dawkins and Avril. The series was broadcast on BBC1, and was overseen by series creator Paul Mendelson. The series was released on DVD on January 26, 2007.","poster_path":"/5xh6Utxnaml4ekKkeFPTEr8YJs9.jpg","season_number":1},{"air_date":"2001-05-14","episode_count":6,"id":1025,"name":"Season 2","overview":"The second series of British television comedy My Hero ran from May 14, 2001 to June 18, 2001. The series featured six episodes, and the entire main cast reprised their characters from series one, with the exception of minor character Avril. This series saw Janet Dawkins become Janet Sunday, after marrying George, and Janet and George having their first child, Ollie Sunday. The series was broadcast on BBC1, and was again overseen by series creator Paul Mendelson. The series was released on DVD on August 7, 2007.","poster_path":"/esOUCzCvTxzIiYa4RmxumT4TPP.jpg","season_number":2},{"air_date":"2002-06-07","episode_count":10,"id":1028,"name":"Season 3","overview":"The third series of British television comedy My Hero ran from June 7, 2002 to August 23, 2002. The series featured ten episodes, and the entire main cast reprised their characters from series two. The series was broadcast on BBC1, and was again overseen by series creator Paul Mendelson. The series was released on DVD on October 7, 2002, becoming the first series of the show to ever be released on DVD.","poster_path":"/8y59q8dEAfCJllyevEED6pY3t93.jpg","season_number":3},{"air_date":"2003-08-08","episode_count":10,"id":1027,"name":"Season 4","overview":"The fourth series of British television comedy My Hero ran from August 8, 2003, to October 10, 2003. It again featured ten episodes, and saw the entire main cast reprise their characters from Series three. The series was once again broadcast on BBC1, and was overseen by series creator Paul Mendelson. The series has never been released on DVD.","poster_path":null,"season_number":4},{"air_date":"2005-01-07","episode_count":10,"id":1026,"name":"Season 5","overview":"","poster_path":null,"season_number":5},{"air_date":"2006-07-21","episode_count":8,"id":1030,"name":"Season 6","overview":"The sixth and final series of British television comedy My Hero ran from July 21, 2006 to September 10, 2006. This series featured eight episodes, and saw the majority of the main cast reprise their characters from Series five, with the exception of George Sunday, who decided to leave the series after episode one. He was replaced by actor James Dreyfus, who took the character of George Sunday into the new alias, George Monday. The series was once again broadcast on BBC1, and was overseen by series creator Paul Mendelson. Due to poor ratings for the series, and the poor public reception to Dreyfus, the series was axed, leading to the final two episodes being broadcast on Sunday lunchtimes, rather than the prime-time slot on Friday evenings. The series has never been released on DVD.","poster_path":null,"season_number":6}],"status":"Ended","type":"Scripted","vote_average":6.3,"vote_count":15}