{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2019-12-23","genres":[],"homepage":"","id":105642,"in_production":true,"languages":[],"last_air_date":"2020-01-20","last_episode_to_air":{"air_date":"2020-01-20","episode_number":5,"id":2337608,"name":"Episode 5","overview":"The story revolves around an aspiring artist manager Zoey Anand and a bratty but kind-hearted event manager Kai Patel. Kai works in his father’s event management company and Zoey works for the talent managing firm that manages the melodious singer Shruti Pathak. ‘The Great Indian Dandiya Festival’ where Shruti Pathak is performing is organized by Kai’s father’s company and he has been left in charge of it. This is Kai’s last chance to prove his worth to his father and on the other hand Zoey is expecting a promotion post this event. This is where our lead characters have a Tryst with destiny.","production_code":"","season_number":1,"show_id":105642,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Situationship","next_episode_to_air":null,"networks":[{"name":"Viu","id":3174,"logo_path":null,"origin_country":""}],"number_of_episodes":5,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Situationship","overview":"Zoey an aspiring artist manager has a challenging day as she struggles to maintain work and personal life balance as she is trying to deal with her Ex trying to surprise her. Meanwhile, Kai event organizer's son gets an ultimatum from his dad against making any mistakes during the event, however Shruti Pathak's dress goes missing as Kai makes a roach from designers cheque. Zoey is busy hunting for Kai and the dress as Kai isn't available of phone or walkie. When Kai and Zoey meet each other both of them are left flabbergasted.","popularity":0.0,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2019-12-23","episode_count":5,"id":155478,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}